[
  {
    "id": 1,
    "name_ar": "ٱلْرَّحْمَـٰنُ",
    "transliteration": "Ar-Rahmān",
    "translation_en": "The Most Gracious",
    "translation_bn": "পরম দয়ালু",
    "description": "He who has mercy on all of creation without distinction. His grace encompasses all beings in this world.",
    "benefit": "Reciting 'Ya Rahmān' frequently can increase one's own compassion and attract Allah's extensive grace. Helps in improving memory.",
    "dua": "Yā Raḥmān, encompass me with Your vast mercy that covers all things, and bless me with a good memory.",
    "quran_reference": {
      "surah": "Ar-Rahman",
      "verse": "1",
      "text_ar": "ٱلْرَّحْمَـٰنُ",
      "text_en": "The Most Gracious."
    },
    "audio_url": "https://yourcdn.com/audio/ar-rahman.mp3",
    "tags": ["Grace", "Compassion", "Universe"],
    "recitation_count": {
      "recommended": 100,
      "reward": "Bestows blessings and kindness from Allah, and removes hardness from the heart."
    },
    "daily_tip": "Show kindness to an animal or plant today, reflecting Allah's universal mercy.",
    "reflections": [
      "Allah's mercy isn't just for believers; it's for everyone and everything.",
      "This name encourages me to be kind to people, regardless of their background."
    ],
    "related_names": ["Ar-Raḥīm", "Al-Laṭīf", "Al-Wadūd"],
    "dhikr_time": "After any obligatory prayer, especially Fajr.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 2,
    "name_ar": "ٱلْرَّحِيْمُ",
    "transliteration": "Ar-Rahīm",
    "translation_en": "The Most Merciful",
    "translation_bn": "পরম করুণাময়",
    "description": "He who acts with extreme kindness and grace, and whose mercy is eternal and specifically for the believers in the hereafter.",
    "benefit": "Reciting 'Ya Rahīm' can bring inner peace, and helps soften a hardened heart. It provides safety from calamities.",
    "dua": "Yā Raḥīm, shower me with Your special mercy on the Day of Judgment and let it reflect in my actions today.",
    "quran_reference": {
      "surah": "Al-Fatihah",
      "verse": "3",
      "text_ar": "ٱلرَّحِيمِ",
      "text_en": "the Most Merciful."
    },
    "audio_url": "https://yourcdn.com/audio/ar-rahim.mp3",
    "tags": ["Mercy", "Forgiveness", "Believers"],
    "recitation_count": {
      "recommended": 100,
      "reward": "Brings mercy from Allah and softens the heart. People will be compassionate towards the reciter."
    },
    "daily_tip": "Forgive someone today for the sake of Allah. Mercy starts with you too.",
    "reflections": [
      "This name gives me hope that Allah never gives up on me, even when I slip.",
      "I should also show mercy to myself and not be too harsh when I make mistakes."
    ],
    "related_names": ["Ar-Raḥmān", "Al-Ghafūr", "At-Tawwāb"],
    "dhikr_time": "After Fajr or during times of stress or sadness.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 3,
    "name_ar": "ٱلْمَلِكُ",
    "transliteration": "Al-Malik",
    "translation_en": "The King",
    "translation_bn": "সার্বভৌম ক্ষমতার অধিকারী",
    "description": "The absolute sovereign and owner of all existence. His reign is supreme and He is in no need of His kingdom or subjects.",
    "benefit": "Reciting 'Ya Malik' gives a sense of honor and respect and can help in gaining authority and control over one's own self.",
    "dua": "Yā Malik, make me content with what You've decreed for me and grant me dominion over my own desires.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "هُوَ ٱللَّهُ ٱلَّذِى لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْمَلِكُ",
      "text_en": "He is Allah, other than whom there is no deity, the Sovereign."
    },
    "audio_url": "https://yourcdn.com/audio/al-malik.mp3",
    "tags": ["Sovereignty", "Power", "Kingdom"],
    "recitation_count": {
      "recommended": 90,
      "reward": "Gains respect and authority among people and financial independence."
    },
    "daily_tip": "Remember that true ownership belongs to Allah. Be a responsible steward of what He has given you.",
    "reflections": [
      "Everything I have is a temporary trust from the true King.",
      "Realizing Allah is the King frees me from fearing any worldly authority."
    ],
    "related_names": ["Al-Mālik-ul-Mulk", "Al-Qahhār", "Al-Jabbār"],
    "dhikr_time": "After Dhuhr prayer or when making important decisions.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 4,
    "name_ar": "ٱلْقُدُّوسُ",
    "transliteration": "Al-Quddūs",
    "translation_en": "The Most Holy",
    "translation_bn": "নিষ্কলুষ, পবিত্র",
    "description": "The one who is absolutely pure, free from any imperfection, error, or fault. He is above any praise that we can imagine.",
    "benefit": "Recitation helps in purifying the heart from evil thoughts and anxieties. It is beneficial for mental well-being.",
    "dua": "Yā Quddūs, purify my heart, my thoughts, and my intentions for Your sake alone.",
    "quran_reference": {
      "surah": "Al-Jumu'ah",
      "verse": "1",
      "text_ar": "ٱلْمَلِكِ ٱلْقُدُّوسِ",
      "text_en": "the Sovereign, the Pure"
    },
    "audio_url": "https://yourcdn.com/audio/al-quddus.mp3",
    "tags": ["Purity", "Holiness", "Perfection"],
    "recitation_count": {
      "recommended": 100,
      "reward": "Frees the heart from worldly worries and purifies the soul from bad habits."
    },
    "daily_tip": "Strive for purity in your speech today. Avoid gossip and harsh words.",
    "reflections": [
      "Allah's purity is absolute, which inspires me to seek spiritual cleanliness.",
      "When my mind is cluttered with negativity, remembering 'Al-Quddus' helps clear it."
    ],
    "related_names": ["As-Salām", "Al-Mu'min", "Al-Bāri'"],
    "dhikr_time": "In the late hours of the night (Tahajjud) or when feeling spiritually low.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 5,
    "name_ar": "ٱلْسَّلَامُ",
    "transliteration": "As-Salām",
    "translation_en": "The Source of Peace",
    "translation_bn": "শান্তি ও নিরাপত্তাদাতা",
    "description": "The one who is free from all deficiencies and the source of all peace, safety, and tranquility.",
    "benefit": "Reciting 'Ya Salām' brings peace to the heart and mind, and provides protection from harm and evil.",
    "dua": "Yā Salām, grant me peace in my heart, my home, and my life, and protect me from all calamities.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلْقُدُّوسُ ٱلسَّلَـٰمُ",
      "text_en": "the Pure, the Perfection"
    },
    "audio_url": "https://yourcdn.com/audio/as-salam.mp3",
    "tags": ["Peace", "Safety", "Tranquility"],
    "recitation_count": {
      "recommended": 160,
      "reward": "Protects from all disasters and illnesses; brings peace to a fearful heart."
    },
    "daily_tip": "Be a source of peace for others today. Greet people with a smile and a kind word.",
    "reflections": [
      "True and lasting peace can only be found through connection with As-Salām.",
      "This name reminds me to avoid conflict and promote harmony in my relationships."
    ],
    "related_names": ["Al-Mu'min", "Al-Laṭīf", "Al-Wadūd"],
    "dhikr_time": "When feeling anxious, or reciting over a sick person for healing.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 6,
    "name_ar": "ٱلْمُؤْمِنُ",
    "transliteration": "Al-Mu'min",
    "translation_en": "The Giver of Faith",
    "translation_bn": "নিরাপত্তা ও ঈমান দানকারী",
    "description": "The one who provides security and peace, and who bestows the gift of faith (Iman) in the hearts of His servants.",
    "benefit": "Recitation protects from harm, especially from Satan, and instills safety and security.",
    "dua": "Yā Mu'min, secure my heart upon Your faith and grant me safety from all fear.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلسَّلَـٰمُ ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ",
      "text_en": "the Perfection, the Giver of Faith, the Overseer."
    },
    "audio_url": "https://yourcdn.com/audio/al-mumin.mp3",
    "tags": ["Faith", "Security", "Trust"],
    "recitation_count": {
      "recommended": 136,
      "reward": "The reciter's family, wealth, and life will be safe from harm."
    },
    "daily_tip": "When you feel fear or anxiety, remember Al-Mu'min, the ultimate source of safety.",
    "reflections": [
      "True security is not in locks or alarms, but in the protection of Al-Mu'min.",
      "Faith itself is a gift from Him. I should be grateful He chose to place it in my heart."
    ],
    "related_names": ["As-Salām", "Al-Muhaymin", "Al-Walīy"],
    "dhikr_time": "When feeling fearful or insecure.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 7,
    "name_ar": "ٱلْمُهَيْمِنُ",
    "transliteration": "Al-Muhaymin",
    "translation_en": "The Guardian",
    "translation_bn": "রক্ষাকর্তা",
    "description": "The one who is the ultimate guardian, witness, and protector over all things. He oversees and preserves every detail.",
    "benefit": "Recitation after ghusl (ritual bath) leads to inner purity and enlightenment.",
    "dua": "Yā Muhaymin, guard my actions, my thoughts, and my heart, and protect me from heedlessness.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلْمُؤْمِنُ ٱلْمُهَيْمِنُ",
      "text_en": "the Giver of Faith, the Overseer"
    },
    "audio_url": "https://yourcdn.com/audio/al-muhaymin.mp3",
    "tags": ["Guardian", "Protector", "Overseer"],
    "recitation_count": {
      "recommended": 145,
      "reward": "The reciter will have a purified outer and inner self."
    },
    "daily_tip": "Live your day consciously, knowing that Al-Muhaymin is witnessing your every action.",
    "reflections": [
      "It's comforting to know a loving Guardian is watching over me at all times.",
      "This name also reminds me to be accountable for my actions, as nothing is hidden from Him."
    ],
    "related_names": ["Ar-Raqīb", "Al-Ḥāfiẓ", "Al-Wakīl"],
    "dhikr_time": "After Isha prayer for spiritual protection.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 8,
    "name_ar": "ٱلْعَزِيزُ",
    "transliteration": "Al-'Azīz",
    "translation_en": "The Almighty",
    "translation_bn": "পরাক্রমশালী",
    "description": "The one who is the most mighty, powerful, and honorable. He is unbeatable and can never be overcome.",
    "benefit": "Recitation brings honor, respect, and self-sufficiency. It helps in overcoming difficulties.",
    "dua": "Yā 'Azīz, grant me honor through obedience to You and protect me from humiliation through disobedience.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلْعَزِيزُ ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ",
      "text_en": "the Exalted in Might, the Compeller, the Superior."
    },
    "audio_url": "https://yourcdn.com/audio/al-aziz.mp3",
    "tags": ["Might", "Power", "Honor"],
    "recitation_count": {
      "recommended": 94,
      "reward": "The reciter will be honored and will not need to depend on anyone."
    },
    "daily_tip": "Seek honor not from people, but from Al-'Azīz, by aligning your life with His commands.",
    "reflections": [
      "True honor belongs only to Allah. Any honor I have is a reflection of His gift.",
      "When I feel weak or defeated, remembering 'Al-'Azīz' gives me strength."
    ],
    "related_names": ["Al-Qawīy", "Al-Matin", "Al-Qahhār"],
    "dhikr_time": "After Fajr prayer for 40 days to gain independence from others.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 9,
    "name_ar": "ٱلْجَبَّارُ",
    "transliteration": "Al-Jabbār",
    "translation_en": "The Compeller",
    "translation_bn": "দুর্নিবার",
    "description": "The one who is overwhelmingly powerful and compels all things to His will. He is the one who mends the broken.",
    "benefit": "Recitation protects from tyranny and oppression, and helps in reforming one's character.",
    "dua": "Yā Jabbār, mend my broken heart and my shortcomings, and protect me from the compulsion of my own desires.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلْعَزِيزُ ٱلْجَبَّارُ",
      "text_en": "the Exalted in Might, the Compeller"
    },
    "audio_url": "https://yourcdn.com/audio/al-jabbar.mp3",
    "tags": ["Power", "Compeller", "Reformer"],
    "recitation_count": {
      "recommended": 206,
      "reward": "The reciter will be safe from the cruelty of tyrants and oppressors."
    },
    "daily_tip": "If you feel broken by a trial, turn to Al-Jabbār, the one who mends and restores.",
    "reflections": [
      "This name has two aspects: overwhelming power over the arrogant, and gentle restoration for the broken.",
      "It teaches me that even when things are out of my control, they are perfectly within His."
    ],
    "related_names": ["Al-Qahhār", "Al-'Azīz", "Al-Muslih (derived)"],
    "dhikr_time": "When facing an oppressor or feeling emotionally broken.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 10,
    "name_ar": "ٱلْمُتَكَبِّرُ",
    "transliteration": "Al-Mutakabbir",
    "translation_en": "The Majestic",
    "translation_bn": "অহংকারের ন্যায্য অধিকারী",
    "description": "The one who is supremely great and for whom greatness is a rightful attribute. He is above the attributes of His creation.",
    "benefit": "Recitation before a task grants success and righteousness. It helps in overcoming pride.",
    "dua": "Yā Mutakabbir, cleanse my heart from arrogance and allow me to see Your supreme greatness.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "23",
      "text_ar": "ٱلْجَبَّارُ ٱلْمُتَكَبِّرُ",
      "text_en": "the Compeller, the Superior."
    },
    "audio_url": "https://yourcdn.com/audio/al-mutakabbir.mp3",
    "tags": ["Greatness", "Majesty", "Pride (Divine)"],
    "recitation_count": {
      "recommended": 662,
      "reward": "The reciter will be granted a righteous child and will be seen as pious and great by people."
    },
    "daily_tip": "Anytime you feel a hint of pride in your accomplishments, remember that true greatness belongs only to Al-Mutakabbir.",
    "reflections": [
      "Pride is a despicable quality in humans because we are created weak, but it is a befitting attribute for the Creator.",
      "This name humbles me and puts me in my place."
    ],
    "related_names": ["Al-Kabīr", "Al-'Azīm", "Al-'Alīy"],
    "dhikr_time": "Before approaching a person of authority or before starting an important task.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 11,
    "name_ar": "ٱلْخَالِقُ",
    "transliteration": "Al-Khāliq",
    "translation_en": "The Creator",
    "translation_bn": "সৃষ্টিকর্তা",
    "description": "The one who brings everything from non-existence into existence. He determines and creates according to a measure.",
    "benefit": "Recitation enlightens the heart and protects against calamities. It enhances creativity.",
    "dua": "Yā Khāliq, You created me in the best of forms. Make my character beautiful as well.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "24",
      "text_ar": "هُوَ ٱللَّهُ ٱلْخَـٰلِقُ ٱلْبَارِئُ ٱلْمُصَوِّرُ",
      "text_en": "He is Allah, the Creator, the Inventor, the Fashioner."
    },
    "audio_url": "https://yourcdn.com/audio/al-khaliq.mp3",
    "tags": ["Creation", "Originator", "Maker"],
    "recitation_count": {
      "recommended": 731,
      "reward": "A guardian angel is appointed to pray for the reciter, and their face will become radiant."
    },
    "daily_tip": "Reflect on the creation of your own body and thank Al-Khāliq for this miracle.",
    "reflections": [
      "Every atom in the universe is a testament to His creative power.",
      "Thinking about this name sparks awe and wonder at the world around me."
    ],
    "related_names": ["Al-Bāri'", "Al-Muṣawwir", "Al-Badī'"],
    "dhikr_time": "During the night, especially for those who are creative professionals.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 12,
    "name_ar": "ٱلْبَارِئُ",
    "transliteration": "Al-Bāri'",
    "translation_en": "The Inventor",
    "translation_bn": "সঠিকভাবে সৃষ্টিকারী",
    "description": "The one who creates and fashions all things from the blueprint He created, in perfect proportion and free from any fault.",
    "benefit": "Recitation helps in healing the sick and can grant a child to the infertile by Allah's will.",
    "dua": "Yā Bāri', grant me healing from every illness, physical and spiritual.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "24",
      "text_ar": "ٱلْخَـٰلِقُ ٱلْبَارِئُ",
      "text_en": "the Creator, the Inventor"
    },
    "audio_url": "https://yourcdn.com/audio/al-bari.mp3",
    "tags": ["Inventor", "Maker", "Healer"],
    "recitation_count": {
      "recommended": 213,
      "reward": "Allah can cure the reciter from illness or grant a child."
    },
    "daily_tip": "When you see something working in perfect order, from your body to an ecosystem, remember Al-Bāri'.",
    "reflections": [
      "If Al-Khāliq is the architect with the blueprint, Al-Bāri' is the master engineer who executes the plan flawlessly.",
      "This name gives me hope for healing, as the one who made me can surely fix me."
    ],
    "related_names": ["Al-Khāliq", "Al-Muṣawwir", "Ash-Shāfī (derived)"],
    "dhikr_time": "When visiting a sick person or for personal healing.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 13,
    "name_ar": "ٱلْمُصَوِّرُ",
    "transliteration": "Al-Muṣawwir",
    "translation_en": "The Fashioner",
    "translation_bn": "আকৃতিদানকারী",
    "description": "The one who shapes and fashions His creation into unique and beautiful forms.",
    "benefit": "Recitation can help a barren woman conceive a child by Allah's permission.",
    "dua": "Yā Muṣawwir, fashion my life and my destiny in a way that is beautiful and pleasing to You.",
    "quran_reference": {
      "surah": "Al-Hashr",
      "verse": "24",
      "text_ar": "ٱلْبَارِئُ ٱلْمُصَوِّرُ",
      "text_en": "the Inventor, the Fashioner"
    },
    "audio_url": "https://yourcdn.com/audio/al-musawwir.mp3",
    "tags": ["Fashioner", "Shaper", "Artist"],
    "recitation_count": {
      "recommended": 336,
      "reward": "Allah may bless the reciter with a beautiful, righteous child."
    },
    "daily_tip": "Appreciate the diversity of human faces and features today, a sign of the ultimate Artist, Al-Muṣawwir.",
    "reflections": [
      "He is the divine artist who sculpted not just my outer form, but my inner disposition too.",
      "The uniqueness of every single human being is a powerful sign of Al-Muṣawwir."
    ],
    "related_names": ["Al-Khāliq", "Al-Bāri'", "Al-Badī'"],
    "dhikr_time": "When desiring a child or when involved in artistic endeavors.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 14,
    "name_ar": "ٱلْغَفَّارُ",
    "transliteration": "Al-Ghaffār",
    "translation_en": "The Great Forgiver",
    "translation_bn": "ক্ষমাময়",
    "description": "The one who forgives sins again and again. He conceals the faults of His servants and forgives them out of His grace.",
    "benefit": "Frequent recitation leads to the forgiveness of sins and provides relief from worldly anxieties.",
    "dua": "Yā Ghaffār, forgive my repeated sins, for You are the only one who forgives endlessly.",
    "quran_reference": {
      "surah": "Nuh",
      "verse": "10",
      "text_ar": "فَقُلْتُ ٱسْتَغْفِرُوا۟ رَبَّكُمْ إِنَّهُۥ كَانَ غَفَّارًا",
      "text_en": "And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver.'"
    },
    "audio_url": "https://yourcdn.com/audio/al-ghaffar.mp3",
    "tags": ["Forgiveness", "Pardon", "Concealment"],
    "recitation_count": {
      "recommended": 1281,
      "reward": "Allah will forgive the reciter's sins and grant them piety."
    },
    "daily_tip": "Make it a habit to say 'Astaghfirullah' (I seek forgiveness from Allah) throughout the day.",
    "reflections": [
      "This name is for people like me, who sin and repent, and sin again. His forgiveness is greater than my sins.",
      "It reminds me to also conceal the faults of others, just as He conceals mine."
    ],
    "related_names": ["Al-Ghafūr", "Al-'Afuww", "At-Tawwāb"],
    "dhikr_time": "After Asr prayer or when seeking forgiveness for habitual sins.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 15,
    "name_ar": "ٱلْقَهَّارُ",
    "transliteration": "Al-Qahhār",
    "translation_en": "The Subduer",
    "translation_bn": "মহাপরাক্রমশালী",
    "description": "The one who has absolute control over all of creation. Nothing can resist His will; He subdues all tyrants and vanquishes all opposition.",
    "benefit": "Recitation frees the heart from attachment to the world and protects against oppressors.",
    "dua": "Yā Qahhār, subdue my inner desires that lead me astray and protect me from those who wish me harm.",
    "quran_reference": {
      "surah": "Ar-Ra'd",
      "verse": "16",
      "text_ar": "وَهُوَ ٱلْوَٰحِدُ ٱلْقَهَّـٰرُ",
      "text_en": "and He is the One, the Prevailing."
    },
    "audio_url": "https://yourcdn.com/audio/al-qahhar.mp3",
    "tags": ["Power", "Dominance", "Subduer"],
    "recitation_count": {
      "recommended": 306,
      "reward": "The reciter will gain victory over their lower self (nafs) and enemies."
    },
    "daily_tip": "When you feel overwhelmed by a negative habit or temptation, call upon Al-Qahhār to help you conquer it.",
    "reflections": [
      "This name is a reminder that no matter how powerful a tyrant seems, they are utterly powerless before Al-Qahhār.",
      "It gives me strength to overcome my own weaknesses, knowing His power can subdue them."
    ],
    "related_names": ["Al-Jabbār", "Al-'Azīz", "Al-Qawīy"],
    "dhikr_time": "When facing a great enemy or an overwhelming internal struggle.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 16,
    "name_ar": "ٱلْوَهَّابُ",
    "transliteration": "Al-Wahhāb",
    "translation_en": "The Giver of All",
    "translation_bn": "মহাদাতা",
    "description": "The one who gives generously and endlessly without expecting anything in return. His gifts encompass all of creation.",
    "benefit": "Recitation after Duha prayer can alleviate poverty and lead to the fulfillment of needs.",
    "dua": "Yā Wahhāb, grant me from Your endless bounty and make me of the grateful.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "8",
      "text_ar": "وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ ٱلْوَهَّابُ",
      "text_en": "and grant us from Yourself mercy. Indeed, You are the Bestower."
    },
    "audio_url": "https://yourcdn.com/audio/al-wahhab.mp3",
    "tags": ["Gifts", "Generosity", "Bestower"],
    "recitation_count": {
      "recommended": 14,
      "reward": "Allah will relieve the reciter from poverty and fulfill their specific need (dua)."
    },
    "daily_tip": "Be generous to someone today without expecting anything in return, reflecting a quality of Al-Wahhāb.",
    "reflections": [
      "Every breath I take is a gift from Al-Wahhāb.",
      "This name teaches me to give freely and to direct my requests only to Him, the ultimate source of all gifts."
    ],
    "related_names": ["Ar-Razzāq", "Al-Karīm", "Al-Mughnī"],
    "dhikr_time": "In prostration (sajdah) after optional prayers, especially when in need.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 17,
    "name_ar": "ٱلْرَّزَّاقُ",
    "transliteration": "Ar-Razzāq",
    "translation_en": "The Sustainer",
    "translation_bn": "রিযিকদাতা",
    "description": "The one who provides all means of subsistence (rizq) for all of His creation, from the smallest insect to the largest whale.",
    "benefit": "Recitation brings blessings (barakah) in one's provisions and livelihood.",
    "dua": "Yā Razzāq, provide for me from sources I could never imagine and bless what you have given me.",
    "quran_reference": {
      "surah": "Adh-Dhariyat",
      "verse": "58",
      "text_ar": "إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
      "text_en": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength."
    },
    "audio_url": "https://yourcdn.com/audio/ar-razzaq.mp3",
    "tags": ["Provision", "Sustenance", "Livelihood"],
    "recitation_count": {
      "recommended": 308,
      "reward": "The reciter will be given an increase in their sustenance."
    },
    "daily_tip": "Before you eat today, take a moment to thank Ar-Razzāq for providing the meal.",
    "reflections": [
      "My salary is just a means; the true provider is Ar-Razzāq. This removes anxiety about my job.",
      "He provides for everyone, even those who disobey Him. This shows the vastness of His providence."
    ],
    "related_names": ["Al-Wahhāb", "Al-Mughnī", "Al-Bāsiṭ"],
    "dhikr_time": "Before Fajr prayer, in the corners of the house, for increase in provision.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 18,
    "name_ar": "ٱلْفَتَّاحُ",
    "transliteration": "Al-Fattāḥ",
    "translation_en": "The Opener",
    "translation_bn": "বিজয়দানকারী",
    "description": "The one who opens all doors of mercy, provision, and guidance. He is the judge who opens the way to victory and truth.",
    "benefit": "Recitation after Fajr prayer with hands on the chest enlightens the heart and makes difficult tasks easy.",
    "dua": "Yā Fattāḥ, open for me the doors of Your mercy, Your wisdom, and Your provision.",
    "quran_reference": {
      "surah": "Saba",
      "verse": "26",
      "text_ar": "قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِٱلْحَقِّ وَهُوَ ٱلْفَتَّاحُ ٱلْعَلِيمُ",
      "text_en": "Say, 'Our Lord will bring us together; then He will judge between us in truth. And He is the Knowing Judge.'"
    },
    "audio_url": "https://yourcdn.com/audio/al-fattah.mp3",
    "tags": ["Opening", "Victory", "Judgment", "Success"],
    "recitation_count": {
      "recommended": 489,
      "reward": "The reciter will be granted victory and a purified heart."
    },
    "daily_tip": "When you feel stuck in a situation, call upon Al-Fattāḥ to open a way out for you.",
    "reflections": [
      "When one door closes, He can open a thousand better doors.",
      "He opens not just physical doors, but also the doors to understanding and insight."
    ],
    "related_names": ["Al-Hādī", "An-Nūr", "Al-Ḥakam"],
    "dhikr_time": "When starting a new venture or feeling trapped in a difficult situation.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 19,
    "name_ar": "ٱلْعَلِيمُ",
    "transliteration": "Al-'Alīm",
    "translation_en": "The All-Knowing",
    "translation_bn": "সর্বজ্ঞ",
    "description": "The one whose knowledge is all-encompassing. He knows what is apparent and what is hidden, the past, present, and future, without any limitation.",
    "benefit": "Recitation increases knowledge and enlightens the heart with divine secrets.",
    "dua": "Yā 'Alīm, grant me beneficial knowledge and teach me what I do not know.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "29",
      "text_ar": "وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ",
      "text_en": "and He is, of all things, Knowing."
    },
    "audio_url": "https://yourcdn.com/audio/al-alim.mp3",
    "tags": ["Knowledge", "Wisdom", "Awareness"],
    "recitation_count": {
      "recommended": 150,
      "reward": "The reciter will be endowed with deep knowledge and faith."
    },
    "daily_tip": "Acknowledge that you know very little and ask Al-'Alīm to increase you in knowledge.",
    "reflections": [
      "I can hide my thoughts from people, but not from Al-'Alīm. This encourages sincerity.",
      "It is comforting to know that He knows my silent prayers and the deepest pains of my heart."
    ],
    "related_names": ["Al-Khabīr", "Al-Ḥakīm", "As-Samī'", "Al-Baṣīr"],
    "dhikr_time": "When studying or seeking to understand a complex matter.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 20,
    "name_ar": "ٱلْقَابِضُ",
    "transliteration": "Al-Qābiḍ",
    "translation_en": "The Constrictor",
    "translation_bn": "সংকোচনকারী",
    "description": "The one who constricts and withholds. He may constrict provisions, or the soul upon death, all according to His perfect wisdom.",
    "benefit": "Recitation protects from starvation and fear.",
    "dua": "Yā Qābiḍ, protect me from the constriction of the heart and the grave.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "245",
      "text_ar": "وَٱللَّهُ يَقْبِضُ وَيَبْصُۜطُ وَإِلَيْهِ تُرْجَعُونَ",
      "text_en": "And Allah withholds and grants abundance, and to Him you will be returned."
    },
    "audio_url": "https://yourcdn.com/audio/al-qabid.mp3",
    "tags": ["Constriction", "Withholding", "Balance"],
    "recitation_count": {
      "recommended": 903,
      "reward": "The reciter will be safe from hunger, thirst and pain."
    },
    "daily_tip": "If you feel your heart or your finances are constricted, know that this is from Al-Qābiḍ and it is a test. Be patient.",
    "reflections": [
      "This name should be understood with its counterpart, Al-Bāsiṭ (The Expander). Life is a cycle of constriction and expansion, all from Him.",
      "Sometimes a constriction is a means of protection or redirection."
    ],
    "related_names": ["Al-Bāsiṭ", "Al-Māni'"],
    "dhikr_time": "During times of hardship or financial difficulty.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 21,
    "name_ar": "ٱلْبَاسِطُ",
    "transliteration": "Al-Bāsiṭ",
    "translation_en": "The Expander",
    "translation_bn": "সম্প্রসারণকারী",
    "description": "The one who expands and grants abundance. He expands provisions, mercy, and the heart with joy, according to His perfect wisdom.",
    "benefit": "Recitation after Duha prayer with open hands brings an increase in provision and removes sorrow.",
    "dua": "Yā Bāsiṭ, expand my provision, my knowledge, and my heart with joy and tranquility.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "245",
      "text_ar": "وَٱللَّهُ يَقْبِضُ وَيَبْصُۜطُ وَإِلَيْهِ تُرْجَعُونَ",
      "text_en": "And Allah withholds and grants abundance, and to Him you will be returned."
    },
    "audio_url": "https://yourcdn.com/audio/al-basit.mp3",
    "tags": ["Expansion", "Abundance", "Relief"],
    "recitation_count": {
      "recommended": 72,
      "reward": "The reciter will become self-sufficient and free from needing others."
    },
    "daily_tip": "When you feel ease and abundance, be grateful to Al-Bāsiṭ and share your blessings with others.",
    "reflections": [
      "Just as He is Al-Qābiḍ, He is Al-Bāsiṭ. This teaches me to be grateful in times of ease and patient in times of difficulty.",
      "An expansion in wealth is a test just as much as a constriction is."
    ],
    "related_names": ["Al-Qābiḍ", "Ar-Razzāq", "Al-Wahhāb"],
    "dhikr_time": "When seeking relief from sorrow or for an increase in livelihood.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 22,
    "name_ar": "ٱلْخَافِضُ",
    "transliteration": "Al-Khāfiḍ",
    "translation_en": "The Abaser",
    "translation_bn": "অবনতকারী",
    "description": "The one who abases and lowers the arrogant, the tyrants, and those who disobey Him.",
    "benefit": "Recitation can provide protection from the harm of enemies.",
    "dua": "Yā Khāfiḍ, abase my enemies and the enemies of the truth, and protect me from the humiliation of sin.",
    "quran_reference": {
      "surah": "Al-Waqi'ah",
      "verse": "3",
      "text_ar": "خَافِضَةٌ رَّافِعَةٌ",
      "text_en": "It will bring down [some] and raise up [others]."
    },
    "audio_url": "https://yourcdn.com/audio/al-khafid.mp3",
    "tags": ["Abaser", "Humbler", "Balance"],
    "recitation_count": {
      "recommended": 1481,
      "reward": "The reciter's need will be fulfilled and they will be safe from oppressors."
    },
    "daily_tip": "Humble yourself before Allah, before you are humbled by circumstance.",
    "reflections": [
      "This name must be understood with its counterpart Ar-Rāfi' (The Exalter). Allah lowers whom He wills and exalts whom He wills.",
      "It is a stark reminder that worldly status is fleeting and can be taken away in an instant."
    ],
    "related_names": ["Ar-Rāfi'", "Al-Mudhill", "Al-Qahhār"],
    "dhikr_time": "When fasting for 3 days and reciting on the 4th day, for protection against an enemy.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 23,
    "name_ar": "ٱلْرَّافِعُ",
    "transliteration": "Ar-Rāfi'",
    "translation_en": "The Exalter",
    "translation_bn": "উন্নতকারী",
    "description": "The one who exalts and raises the believers in rank and honor, both in this world and the next.",
    "benefit": "Recitation brings honor, promotion, and raises one's spiritual station.",
    "dua": "Yā Rāfi', exalt my status in Your sight and among the righteous.",
    "quran_reference": {
      "surah": "Al-Waqi'ah",
      "verse": "3",
      "text_ar": "خَافِضَةٌ رَّافِعَةٌ",
      "text_en": "It will bring down [some] and raise up [others]."
    },
    "audio_url": "https://yourcdn.com/audio/ar-rafi.mp3",
    "tags": ["Exalter", "Honor", "Rank"],
    "recitation_count": {
      "recommended": 351,
      "reward": "The reciter will gain respect and high rank in the eyes of people."
    },
    "daily_tip": "The path to being exalted by Ar-Rāfi' is through humility (Tawāḍu') for the sake of Allah.",
    "reflections": [
      "True exaltation is not from a promotion at work, but from being raised in rank by Allah.",
      "He can raise the lowest of the low to the highest of the high. This gives hope to the downtrodden."
    ],
    "related_names": ["Al-Khāfiḍ", "Al-Mu'izz", "Al-'Alīy"],
    "dhikr_time": "At midnight or midday for an increase in status.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 24,
    "name_ar": "ٱلْمُعِزُّ",
    "transliteration": "Al-Mu'izz",
    "translation_en": "The Bestower of Honors",
    "translation_bn": "সম্মানদাতা",
    "description": "The one who gives honor and dignity to whom He wills. True honor comes only from Him.",
    "benefit": "Recitation on Friday or Monday nights brings respect and reverence from others.",
    "dua": "Yā Mu'izz, grant me honor in this life and the next, and make me honored in Your eyes, not the eyes of people.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "26",
      "text_ar": "وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ",
      "text_en": "You honor whom You will and You humble whom You will."
    },
    "audio_url": "https://yourcdn.com/audio/al-muizz.mp3",
    "tags": ["Honor", "Dignity", "Respect"],
    "recitation_count": {
      "recommended": 117,
      "reward": "The reciter will be free from fear of anyone except Allah and will be respected."
    },
    "daily_tip": "If you want honor from people, seek it by obeying the one who bestows all honor, Al-Mu'izz.",
    "reflections": [
      "This name is paired with Al-Mudhill (The Humiliator). He controls the dynamics of honor and disgrace.",
      "Seeking honor from creation is a form of shirk. This name redirects my heart to seek it only from the Creator."
    ],
    "related_names": ["Al-Mudhill", "Ar-Rāfi'", "'Azīz"],
    "dhikr_time": "After Maghrib prayer on Monday and Friday.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 25,
    "name_ar": "ٱلْمُذِلُّ",
    "transliteration": "Al-Mudhill",
    "translation_en": "The Humiliator",
    "translation_bn": "অপমানকারী",
    "description": "The one who disgraces or humiliates whom He wills, as a just consequence for their arrogance and transgression.",
    "benefit": "Recitation provides protection from envious people and oppressors.",
    "dua": "Yā Mudhill, protect me from the humiliation of being defeated by my enemies and from the disgrace of sin.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "26",
      "text_ar": "وَتُعِزُّ مَن تَشَآءُ وَتُذِلُّ مَن تَشَآءُ",
      "text_en": "You honor whom You will and You humble whom You will."
    },
    "audio_url": "https://yourcdn.com/audio/al-mudhill.mp3",
    "tags": ["Humiliation", "Disgrace", "Justice"],
    "recitation_count": {
      "recommended": 770,
      "reward": "The reciter will be safe from the evil of envious people and oppressors."
    },
    "daily_tip": "Avoid humiliating others, lest you be humiliated by Al-Mudhill.",
    "reflections": [
      "This is the counterpart to Al-Mu'izz. It serves as a warning against arrogance.",
      "The ultimate humiliation is on the Day of Judgment. This name reminds me to live a life that avoids that fate."
    ],
    "related_names": ["Al-Mu'izz", "Al-Khāfiḍ", "Al-Muntaqim"],
    "dhikr_time": "In prostration (sajdah) when seeking protection from a specific harm.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 26,
    "name_ar": "ٱلْسَّمِيعُ",
    "transliteration": "As-Samī'",
    "translation_en": "The All-Hearing",
    "translation_bn": "সর্বশ্রোতা",
    "description": "The one who hears all sounds, thoughts, and supplications. Nothing is hidden from His hearing, whether it is spoken aloud or concealed in the heart.",
    "benefit": "Recitation leads to the acceptance of one's supplications (duas).",
    "dua": "Yā Samī', You hear my every plea. Grant me what I ask for and what I am unable to voice.",
    "quran_reference": {
      "surah": "Al-Isra",
      "verse": "1",
      "text_ar": "إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
      "text_en": "Indeed, He is the Hearing, the Seeing."
    },
    "audio_url": "https://yourcdn.com/audio/as-sami.mp3",
    "tags": ["Hearing", "Listening", "Prayer"],
    "recitation_count": {
      "recommended": 180,
      "reward": "The reciter's prayers will be answered, by the will of Allah."
    },
    "daily_tip": "Speak good or remain silent, for As-Samī' hears everything you say.",
    "reflections": [
      "I never have to shout or wonder if I'm being heard. He hears the footsteps of a black ant on a black rock in the darkest night.",
      "This is incredibly comforting. I am never truly alone with my thoughts."
    ],
    "related_names": ["Al-Baṣīr", "Al-'Alīm", "Al-Mujīb"],
    "dhikr_time": "On Thursdays after Dhuhr prayer for acceptance of duas.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 27,
    "name_ar": "ٱلْبَصِيرُ",
    "transliteration": "Al-Baṣīr",
    "translation_en": "The All-Seeing",
    "translation_bn": "সর্বদ্রষ্টা",
    "description": "The one who sees all things, apparent and hidden. Nothing escapes His sight, no matter how small or concealed.",
    "benefit": "Recitation between Sunnah and Fard of Fajr prayer improves eyesight and grants spiritual insight.",
    "dua": "Yā Baṣīr, grant me the insight to see the truth as truth and falsehood as falsehood, and protect my gaze from what displeases You.",
    "quran_reference": {
      "surah": "Al-Isra",
      "verse": "1",
      "text_ar": "إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ",
      "text_en": "Indeed, He is the Hearing, the Seeing."
    },
    "audio_url": "https://yourcdn.com/audio/al-basir.mp3",
    "tags": ["Seeing", "Sight", "Insight"],
    "recitation_count": {
      "recommended": 302,
      "reward": "The reciter will be taken into Allah's care and will be given strength of vision."
    },
    "daily_tip": "Be mindful of what you look at today, knowing that Al-Baṣīr sees your every glance.",
    "reflections": [
      "This name promotes accountability. I can't get away with anything in secret.",
      "It's also a source of comfort, knowing He sees my struggles and tears even when no one else does."
    ],
    "related_names": ["As-Samī'", "Al-'Alīm", "Ar-Raqīb", "Ash-Shahīd"],
    "dhikr_time": "Before Friday prayer for spiritual enlightenment.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 28,
    "name_ar": "ٱلْحَكَمُ",
    "transliteration": "Al-Ḥakam",
    "translation_en": "The Judge",
    "translation_bn": "বিচারক",
    "description": "The one who is the absolute and most just judge. His judgment is final, and no one can overturn His decree.",
    "benefit": "Recitation in the later part of the night can lead to the heart becoming a vessel of divine secrets.",
    "dua": "Yā Ḥakam, judge between us and our people in truth, for You are the best of judges.",
    "quran_reference": {
      "surah": "Al-An'am",
      "verse": "114",
      "text_ar": "أَفَغَيْرَ ٱللَّهِ أَبْتَغِى حَكَمًا",
      "text_en": "Then is it other than Allah I should seek as judge...?"
    },
    "audio_url": "https://yourcdn.com/audio/al-hakam.mp3",
    "tags": ["Judgment", "Wisdom", "Justice"],
    "recitation_count": {
      "recommended": 68,
      "reward": "Spiritual secrets may be revealed to the reciter."
    },
    "daily_tip": "When in a dispute, try to judge with fairness and equity, reflecting the quality of the ultimate Judge.",
    "reflections": [
      "Worldly courts can be flawed, but His court is perfect. This gives ultimate hope for justice.",
      "This name reminds me to accept His decree (hukm) in my life, knowing it is based on perfect wisdom."
    ],
    "related_names": ["Al-'Adl", "Al-Fattāḥ", "Al-Muqsiṭ"],
    "dhikr_time": "Late at night, in a state of wudu, for spiritual openings.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 29,
    "name_ar": "ٱلْعَدْلُ",
    "transliteration": "Al-'Adl",
    "translation_en": "The Just",
    "translation_bn": "ন্যায়নিষ্ঠ",
    "description": "The one who is utterly and perfectly just. His nature is pure justice, free from any oppression or bias.",
    "benefit": "Recitation on a piece of bread on Friday night can make people obedient and well-disposed towards the reciter.",
    "dua": "Yā 'Adl, make me one who upholds justice in all my affairs, even if it is against myself.",
    "quran_reference": {
      "surah": "Al-An'am",
      "verse": "115",
      "text_ar": "وَتَمَّتْ كَلِمَتُ رَبِّكَ صِدْقًا وَعَدْلًا",
      "text_en": "And the word of your Lord has been fulfilled in truth and in justice."
    },
    "audio_url": "https://yourcdn.com/audio/al-adl.mp3",
    "tags": ["Justice", "Fairness", "Equity"],
    "recitation_count": {
      "recommended": 104,
      "reward": "The reciter will be respected for their fairness and good character."
    },
    "daily_tip": "Treat all people with justice today, regardless of your personal feelings about them.",
    "reflections": [
      "Allah is never unjust, not even by an atom's weight. Any suffering I face has a wisdom behind it.",
      "This name inspires me to fight for justice and stand up for the oppressed."
    ],
    "related_names": ["Al-Ḥakam", "Al-Muqsiṭ"],
    "dhikr_time": "When dealing with legal matters or seeking a just outcome.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 30,
    "name_ar": "ٱلْلَّطِيفُ",
    "transliteration": "Al-Laṭīf",
    "translation_en": "The Subtle One",
    "translation_bn": "সূক্ষ্মদর্শী",
    "description": "The One who is most subtle and gracious. His actions are so fine that they are beyond perception, and He is aware of the most hidden details.",
    "benefit": "Recitation leads to the fulfillment of desires and relief from hardship and illness.",
    "dua": "Yā Laṭīf, be gracious to me in Your decree and show me Your subtle kindness in my affairs.",
    "quran_reference": {
      "surah": "Al-Mulk",
      "verse": "14",
      "text_ar": "أَلَا يَعْلَمُ مَنْ خَلَقَ وَهُوَ ٱللَّطِيفُ ٱلْخَبِيرُ",
      "text_en": "Does He who created not know, while He is the Subtle, the Aware?"
    },
    "audio_url": "https://yourcdn.com/audio/al-latif.mp3",
    "tags": ["Subtle", "Gracious", "Kindness"],
    "recitation_count": {
      "recommended": 129,
      "reward": "Allah will grant blessings and relief from poverty and loneliness."
    },
    "daily_tip": "Look for the subtle blessings in your day that you might have overlooked.",
    "reflections": [
      "Allah's help can come in ways I don't even notice. It's not always a grand miracle.",
      "This name brings comfort, knowing He is aware of my most subtle, unexpressed feelings."
    ],
    "related_names": ["Al-Khabīr", "Ar-Ra'ūf", "Al-Wadūd"],
    "dhikr_time": "When facing a complex problem or feeling unwell.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 31,
    "name_ar": "ٱلْخَبِيرُ",
    "transliteration": "Al-Khabīr",
    "translation_en": "The All-Aware",
    "translation_bn": "সর্ববিষয়ে অবগত",
    "description": "The one who is perfectly aware of the inner realities and hidden significances of all things. Nothing is hidden from His awareness.",
    "benefit": "Recitation helps in gaining freedom from a bad habit and receiving news from the unseen.",
    "dua": "Yā Khabīr, You are aware of my hidden state. Rectify my affairs, both inward and outward.",
    "quran_reference": {
      "surah": "Al-Mulk",
      "verse": "14",
      "text_ar": "وَهُوَ ٱللَّطِيفُ ٱلْخَبِيرُ",
      "text_en": "while He is the Subtle, the Aware."
    },
    "audio_url": "https://yourcdn.com/audio/al-khabir.mp3",
    "tags": ["Awareness", "Knowledge", "Reality"],
    "recitation_count": {
      "recommended": 812,
      "reward": "The reciter will be freed from bad habits and will learn about hidden matters."
    },
    "daily_tip": "Be sincere in your intentions, for Al-Khabīr is aware of the true motives behind your actions.",
    "reflections": [
      "While Al-'Alīm knows, Al-Khabīr has a deeper awareness of the 'how' and 'why' of things. It's like the difference between knowledge and expertise.",
      "It is comforting that He is aware of the full context of my situation, even when I can't explain it."
    ],
    "related_names": ["Al-'Alīm", "Al-Laṭīf", "Ash-Shahīd"],
    "dhikr_time": "For deliverance from a bad habit or to understand the reality of a situation.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 32,
    "name_ar": "ٱلْحَلِيمُ",
    "transliteration": "Al-Ḥalīm",
    "translation_en": "The Forbearing",
    "translation_bn": "সহনশীল",
    "description": "The one who is most forbearing and clement. He sees disobedience but does not rush to punish, giving ample time for repentance.",
    "benefit": "Recitation calms anger, soothes grief, and provides safety for possessions.",
    "dua": "Yā Ḥalīm, grant me forbearance and the ability to control my anger for Your sake.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "235",
      "text_ar": "وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَفُورٌ حَلِيمٌ",
      "text_en": "And know that Allah is Forgiving and Forbearing."
    },
    "audio_url": "https://yourcdn.com/audio/al-halim.mp3",
    "tags": ["Forbearance", "Patience", "Clemency"],
    "recitation_count": {
      "recommended": 88,
      "reward": "The reciter will be blessed with tranquility and will be safe from loss."
    },
    "daily_tip": "When someone provokes you today, practice forbearance (hilm) and respond with calmness.",
    "reflections": [
      "Allah's forbearance with me is a great mercy. If He punished me for every sin instantly, I would be destroyed.",
      "This name inspires me to be patient and gentle with people's mistakes."
    ],
    "related_names": ["Aṣ-Ṣabūr", "Al-Ghafūr", "Al-'Afuww"],
    "dhikr_time": "When feeling angry or when written on something to protect it from harm.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 33,
    "name_ar": "ٱلْعَظِيمُ",
    "transliteration": "Al-'Aẓīm",
    "translation_en": "The Magnificent",
    "translation_bn": "সুমহান",
    "description": "The one whose greatness is beyond measure and comprehension. He is the most magnificent in His essence, attributes, and actions.",
    "benefit": "Recitation brings respect, dignity, and healing from sickness.",
    "dua": "Yā 'Aẓīm, fill my heart with awe of Your magnificence and make my worldly problems seem small in comparison.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "255",
      "text_ar": "وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
      "text_en": "And He is the Most High, the Most Great."
    },
    "audio_url": "https://yourcdn.com/audio/al-azim.mp3",
    "tags": ["Magnificence", "Greatness", "Supremacy"],
    "recitation_count": {
      "recommended": 1020,
      "reward": "The reciter will be respected and honored by people and will be cured from illnesses."
    },
    "daily_tip": "When you say 'Subḥāna Rabbī al-'Aẓīm' in rukū' (bowing), feel the meaning and the greatness of the one you are bowing to.",
    "reflections": [
      "Reflecting on the vastness of the universe gives a glimpse into the greatness of its Creator.",
      "Remembering Al-'Aẓīm puts my own problems and worries into perspective."
    ],
    "related_names": ["Al-Kabīr", "Al-Mutakabbir", "Al-Jalīl"],
    "dhikr_time": "When in awe of creation or when seeking healing.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 34,
    "name_ar": "ٱلْغَفُورُ",
    "transliteration": "Al-Ghafūr",
    "translation_en": "The All-Forgiving",
    "translation_bn": "পরম ক্ষমাশীল",
    "description": "The one who forgives abundantly. He is the perfection of forgiveness.",
    "benefit": "Recitation can alleviate headaches, fever, and grief. It is a means of seeking forgiveness for sins.",
    "dua": "Yā Ghafūr, forgive my sins, both major and minor, for there is no forgiver of sins but You.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "89",
      "text_ar": "فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ",
      "text_en": "then indeed, Allah is Forgiving and Merciful."
    },
    "audio_url": "https://yourcdn.com/audio/al-ghafur.mp3",
    "tags": ["Forgiveness", "Pardon", "Mercy"],
    "recitation_count": {
      "recommended": 1286,
      "reward": "The reciter's sins will be forgiven and they will be relieved of worries."
    },
    "daily_tip": "Don't delay repentance. Turn to Al-Ghafūr as soon as you realize you have erred.",
    "reflections": [
      "While Al-Ghaffār emphasizes repeated forgiveness, Al-Ghafūr emphasizes the quality and perfection of forgiveness.",
      "This name is a constant source of hope, no matter how great my sins may seem."
    ],
    "related_names": ["Al-Ghaffār", "Al-'Afuww", "At-Tawwāb"],
    "dhikr_time": "In prostration (sajdah) after committing a sin.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 35,
    "name_ar": "ٱلْشَّكُورُ",
    "transliteration": "Ash-Shakūr",
    "translation_en": "The Appreciative",
    "translation_bn": "গুণগ্রাহী",
    "description": "The one who is most appreciative of the good deeds of His servants. He rewards abundantly for even the smallest act of obedience.",
    "benefit": "Recitation helps relieve sorrow, poverty, and physical ailments. It helps in developing a grateful heart.",
    "dua": "Yā Shakūr, accept my meager deeds and reward me from Your vast appreciation, and make me of the grateful.",
    "quran_reference": {
      "surah": "Fatir",
      "verse": "30",
      "text_ar": "إِنَّهُۥ غَفُورٌ شَكُورٌ",
      "text_en": "Indeed, He is Forgiving and Appreciative."
    },
    "audio_url": "https://yourcdn.com/audio/ash-shakur.mp3",
    "tags": ["Appreciation", "Gratitude", "Reward"],
    "recitation_count": {
      "recommended": 526,
      "reward": "The reciter's hardships will be removed and their deeds will be accepted."
    },
    "daily_tip": "Do a small, secret good deed today, knowing that Ash-Shakūr appreciates it immensely.",
    "reflections": [
      "It is amazing that the Lord of the worlds appreciates my tiny efforts.",
      "This name motivates me to do good, no matter how small, because He multiples the reward beyond measure."
    ],
    "related_names": ["Al-Karīm", "Al-Wahhāb", "Al-Ḥamīd"],
    "dhikr_time": "When feeling down or that your efforts are not being appreciated.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 36,
    "name_ar": "ٱلْعَلِيُّ",
    "transliteration": "Al-'Alīy",
    "translation_en": "The Most High",
    "translation_bn": "অত্যুচ্চ",
    "description": "The one who is exalted and high above all of creation. His highness is absolute in His essence, status, and power.",
    "benefit": "Recitation can lead to an increase in status, success, and the fulfillment of desires.",
    "dua": "Yā 'Alīy, by Your highness, elevate my faith and my station in this life and the next.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "255",
      "text_ar": "وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ",
      "text_en": "And He is the Most High, the Most Great."
    },
    "audio_url": "https://yourcdn.com/audio/al-aliy.mp3",
    "tags": ["Highness", "Exalted", "Supremacy"],
    "recitation_count": {
      "recommended": 110,
      "reward": "The reciter will be blessed with faith, success and their destiny will be elevated."
    },
    "daily_tip": "When you say 'Allāhu Akbar', remember that He is higher and greater than anything occupying your mind.",
    "reflections": [
      "This name establishes Allah's absolute transcendence. Nothing is like Him.",
      "It reminds me to raise my aspirations towards high matters (my faith) and not get stuck in lowliness (sins and trivialities)."
    ],
    "related_names": ["Al-Muta'ālī", "Ar-Rāfi'", "Al-'Aẓīm"],
    "dhikr_time": "For travelers for a safe return, or for those seeking promotion.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 37,
    "name_ar": "ٱلْكَبِيرُ",
    "transliteration": "Al-Kabīr",
    "translation_en": "The Greatest",
    "translation_bn": "সুমহান",
    "description": "The one who is greater than everything. His essence is perfect greatness.",
    "benefit": "Recitation can lead to being reinstated to a post after dismissal and brings respect.",
    "dua": "Yā Kabīr, You are greater than all my problems. Grant me relief and victory.",
    "quran_reference": {
      "surah": "Ar-Ra'd",
      "verse": "9",
      "text_ar": "ٱلْكَبِيرُ ٱلْمُتَعَالِ",
      "text_en": "the Grand, the Exalted."
    },
    "audio_url": "https://yourcdn.com/audio/al-kabir.mp3",
    "tags": ["Greatness", "Grandeur", "Supremacy"],
    "recitation_count": {
      "recommended": 232,
      "reward": "The reciter will be granted honor and will be successful against their rivals."
    },
    "daily_tip": "When facing a daunting task, remember you have the support of Al-Kabīr, who is greater than any challenge.",
    "reflections": [
      "The phrase 'Allāhu Akbar' (Allah is the Greatest) is a central part of a Muslim's life, constantly reminding us of this attribute.",
      "No matter how 'great' someone seems in this world, their greatness is nothing compared to His."
    ],
    "related_names": ["Al-'Aẓīm", "Al-Mutakabbir", "Al-Jalīl"],
    "dhikr_time": "When in debt or dismissed from a position.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 38,
    "name_ar": "ٱلْحَفِيظُ",
    "transliteration": "Al-Ḥāfiẓ",
    "translation_en": "The Preserver",
    "translation_bn": "রক্ষাকর্তা",
    "description": "The one who preserves and guards all of creation. He protects His servants from harm and preserves their good deeds.",
    "benefit": "Recitation provides protection from all dangers, accidents, and losses. It helps in controlling fear.",
    "dua": "Yā Ḥāfiẓ, protect me, my family, and my faith from all harm, seen and unseen.",
    "quran_reference": {
      "surah": "Hud",
      "verse": "57",
      "text_ar": "إِنَّ رَبِّى عَلَىٰ كُلِّ شَىْءٍ حَفِيظٌ",
      "text_en": "Indeed, my Lord is, over all things, a Guardian."
    },
    "audio_url": "https://yourcdn.com/audio/al-hafiz.mp3",
    "tags": ["Protection", "Preservation", "Guardian"],
    "recitation_count": {
      "recommended": 998,
      "reward": "The reciter will be safe from all fears, losses and harms."
    },
    "daily_tip": "When leaving your home, recite 'Bismillāhi tawakkaltu 'alallāh' and entrust your safety to Al-Ḥāfiẓ.",
    "reflections": [
      "He preserves the entire universe from collapsing. Surely, He can preserve my small life and faith.",
      "This name is a powerful antidote to anxiety and fear about the future."
    ],
    "related_names": ["Al-Muhaymin", "Ar-Raqīb", "Al-Wakīl"],
    "dhikr_time": "When traveling, or feeling scared or threatened.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 39,
    "name_ar": "ٱلْمُقِيتُ",
    "transliteration": "Al-Muqīt",
    "translation_en": "The Nourisher",
    "translation_bn": "আহার্যদাতা",
    "description": "The one who provides nourishment and sustenance for all bodies and souls. He has power over all things.",
    "benefit": "Recitation upon a crying child can soothe them. It helps in ensuring provisions during hardship.",
    "dua": "Yā Muqīt, nourish my body with pure provision and my soul with faith and wisdom.",
    "quran_reference": {
      "surah": "An-Nisa",
      "verse": "85",
      "text_ar": "وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ مُّقِيتًا",
      "text_en": "And ever is Allah, over all things, a Keeper."
    },
    "audio_url": "https://yourcdn.com/audio/al-muqit.mp3",
    "tags": ["Nourishment", "Sustenance", "Power"],
    "recitation_count": {
      "recommended": 550,
      "reward": "If recited over an empty vessel, it will be filled with water. The needs of a fasting person will be fulfilled."
    },
    "daily_tip": "Be mindful of your spiritual nourishment (prayer, dhikr, Quran) just as you are mindful of your physical food.",
    "reflections": [
      "This goes beyond Ar-Razzāq. It's not just about providing food, but providing the exact nourishment needed for everything to survive and function.",
      "It also refers to power, as one who can provide nourishment must have power over the one being nourished."
    ],
    "related_names": ["Ar-Razzāq", "Al-Ḥāfiẓ", "Al-Ghanī"],
    "dhikr_time": "When in need of food or provision, or to calm a child.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 40,
    "name_ar": "ٱلْحَسِيبُ",
    "transliteration": "Al-Ḥasīb",
    "translation_en": "The Reckoner",
    "translation_bn": "হিসাব গ্রহণকারী",
    "description": "The one who is sufficient for all. He is the one who will take account of every deed on the Day of Judgment.",
    "benefit": "Recitation provides protection from thieves, enemies, and evil eye. It makes one sufficient.",
    "dua": "Yā Ḥasīb, be sufficient for me in all my affairs. Grant me an easy reckoning on the Day of Judgment.",
    "quran_reference": {
      "surah": "An-Nisa",
      "verse": "6",
      "text_ar": "وَكَفَىٰ بِٱللَّهِ حَسِيبًا",
      "text_en": "And sufficient is Allah as an Accountant."
    },
    "audio_url": "https://yourcdn.com/audio/al-hasib.mp3",
    "tags": ["Sufficient", "Reckoner", "Accountant"],
    "recitation_count": {
      "recommended": 80,
      "reward": "The reciter will be safe from all fears and troubles."
    },
    "daily_tip": "When you feel overwhelmed, recite 'Ḥasbunallāhu wa ni'mal-Wakīl' (Allah is sufficient for us, and He is the best Disposer of affairs).",
    "reflections": [
      "This name has two meanings: The one who is sufficient, and the one who takes account. They are related: if He is sufficient for me, I should be ready to be accountable to Him.",
      "Knowing He is the Reckoner encourages me to keep my own account in this life before the final account is taken."
    ],
    "related_names": ["Al-Kāfī (derived)", "Al-Wakīl", "Al-'Alīm"],
    "dhikr_time": "When facing a problem or fearing someone, starting from Thursday for 7 days.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 41,
    "name_ar": "ٱلْجَلِيلُ",
    "transliteration": "Al-Jalīl",
    "translation_en": "The Majestic",
    "translation_bn": "মহিমান্বিত",
    "description": "The one who is majestic in His essence and attributes. His greatness inspires awe and reverence.",
    "benefit": "Recitation brings reverence and respect.",
    "dua": "Yā Jalīl, fill my heart with awe for Your majesty and reverence for Your commands.",
    "quran_reference": {
      "surah": "Ar-Rahman",
      "verse": "27",
      "text_ar": "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَـٰلِ وَٱلْإِكْرَامِ",
      "text_en": "And there will remain the Face of your Lord, Owner of Majesty and Honor."
    },
    "audio_url": "https://yourcdn.com/audio/al-jalil.mp3",
    "tags": ["Majesty", "Glory", "Awe"],
    "recitation_count": {
      "recommended": 73,
      "reward": "The reciter will be honored and respected by creation."
    },
    "daily_tip": "Spend some time in nature today and reflect on the majesty of the creation to get a sense of the majesty of the Creator.",
    "reflections": [
      "This name is about the greatness of attributes, inspiring awe and love, not fear.",
      "Contemplating Al-Jalīl makes me feel small but in a comforting way, as I am under the care of such a majestic Lord."
    ],
    "related_names": ["Al-'Aẓīm", "Al-Kabīr", "Dhul-Jalāli wal-Ikrām"],
    "dhikr_time": "For those in positions of authority to gain respect.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 42,
    "name_ar": "ٱلْكَرِيمُ",
    "transliteration": "Al-Karīm",
    "translation_en": "The Generous",
    "translation_bn": "অনুগ্রহশীল",
    "description": "The one who is the most generous and honorable. He gives without being asked and forgives without being reminded.",
    "benefit": "Recitation brings honor and generosity in this life and the next. It helps in overcoming financial difficulties.",
    "dua": "Yā Karīm, be generous with me in Your forgiveness and Your provision.",
    "quran_reference": {
      "surah": "Al-Infitar",
      "verse": "6",
      "text_ar": "يَـٰٓأَيُّهَا ٱلْإِنسَـٰنُ مَا غَرَّكَ بِرَبِّكَ ٱلْكَرِيمِ",
      "text_en": "O mankind, what has deceived you concerning your Lord, the Generous,"
    },
    "audio_url": "https://yourcdn.com/audio/al-karim.mp3",
    "tags": ["Generosity", "Honor", "Bounty"],
    "recitation_count": {
      "recommended": 270,
      "reward": "The reciter will be honored by Allah and by people."
    },
    "daily_tip": "Be generous with your time, knowledge, or smile today, reflecting the quality of Al-Karīm.",
    "reflections": [
      "His generosity is such that He is ashamed to turn away empty the hands that are raised to Him.",
      "This name encourages me to have high hopes in Allah and never think that what I am asking for is 'too much'."
    ],
    "related_names": ["Al-Wahhāb", "Al-Jawād (derived)", "Ash-Shakūr"],
    "dhikr_time": "Frequently, especially before sleeping, to gain honor.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 43,
    "name_ar": "ٱلْرَّقِيبُ",
    "transliteration": "Ar-Raqīb",
    "translation_en": "The Watchful One",
    "translation_bn": "তত্ত্বাবধায়ক",
    "description": "The one who is ever-watchful and observant. Nothing escapes His notice, and He keeps watch over every soul.",
    "benefit": "Recitation provides protection for one's family and property and creates God-consciousness.",
    "dua": "Yā Raqīb, make me ever-watchful of my duties to You and conscious of Your watchfulness over me.",
    "quran_reference": {
      "surah": "An-Nisa",
      "verse": "1",
      "text_ar": "إِنَّ ٱللَّهَ كَانَ عَلَيْكُمْ رَقِيبًا",
      "text_en": "Indeed, Allah is ever, over you, an Observer."
    },
    "audio_url": "https://yourcdn.com/audio/ar-raqib.mp3",
    "tags": ["Watchful", "Observer", "Guardian"],
    "recitation_count": {
      "recommended": 312,
      "reward": "The reciter's family and property will be under divine protection."
    },
    "daily_tip": "Before you act or speak, remind yourself 'Ar-Raqīb is watching'. This will help you avoid sin.",
    "reflections": [
      "This name is the foundation of 'Muraqabah' - the state of being constantly aware of Allah's presence.",
      "Knowing I'm being watched by a loving Guardian prevents me from feeling lonely and encourages me to behave well."
    ],
    "related_names": ["Al-Muhaymin", "Al-Baṣīr", "Ash-Shahīd"],
    "dhikr_time": "When wanting to protect one's family or property from harm.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 44,
    "name_ar": "ٱلْمُجِيبُ",
    "transliteration": "Al-Mujīb",
    "translation_en": "The Responder to Prayer",
    "translation_bn": "দু'আ কবুলকারী",
    "description": "The one who responds to the needs and prayers of His servants. He answers every supplication.",
    "benefit": "Recitation ensures that one's supplications (duas) are answered by Allah.",
    "dua": "Yā Mujīb, I am calling upon You, so respond to my call and grant me my heart's righteous desires.",
    "quran_reference": {
      "surah": "Hud",
      "verse": "61",
      "text_ar": "إِنَّ رَبِّى قَرِيبٌ مُّجِيبٌ",
      "text_en": "Indeed, my Lord is near and responsive."
    },
    "audio_url": "https://yourcdn.com/audio/al-mujib.mp3",
    "tags": ["Responsive", "Answerer", "Prayer"],
    "recitation_count": {
      "recommended": 55,
      "reward": "The reciter's dua will be accepted."
    },
    "daily_tip": "Make dua with full conviction that Al-Mujīb is listening and will respond in the best way for you.",
    "reflections": [
      "He is closer to me than my jugular vein and responds to my call. This is the most intimate of relationships.",
      "A response isn't always a 'yes'. It can be a 'no' for my own protection, or a 'wait' for a better time, or a 'here is something better'."
    ],
    "related_names": ["As-Samī'", "Al-Qarīb (derived)", "Al-Wahhāb"],
    "dhikr_time": "During supplication (dua), especially when in desperate need.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 45,
    "name_ar": "ٱلْوَاسِعُ",
    "transliteration": "Al-Wāsi'",
    "translation_en": "The All-Encompassing",
    "translation_bn": "সর্বব্যাপী",
    "description": "The one whose embrace is all-encompassing. His knowledge, mercy, and provision are boundless and extend to all of creation.",
    "benefit": "Recitation leads to freedom from financial difficulties and opens the heart to receive more.",
    "dua": "Yā Wāsi', expand my heart to encompass love for You and Your creation, and expand my provision.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "268",
      "text_ar": "وَٱللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلًا وَٱللَّهُ وَٰسِعٌ عَلِيمٌ",
      "text_en": "while Allah promises you forgiveness from Him and bounty. And Allah is all-Encompassing and Knowing."
    },
    "audio_url": "https://yourcdn.com/audio/al-wasi.mp3",
    "tags": ["Vast", "Encompassing", "Boundless"],
    "recitation_count": {
      "recommended": 137,
      "reward": "The reciter will be blessed with wealth and contentment."
    },
    "daily_tip": "Don't be narrow-minded. Try to be more understanding and accommodating of others, reflecting the vastness of Al-Wāsi'.",
    "reflections": [
      "His mercy is vast enough to cover all my sins. His provision is vast enough to provide for all of creation without diminishing.",
      "This name cures the poverty of the mind and heart."
    ],
    "related_names": ["Al-Ghanī", "Ar-Razzāq", "Al-'Alīm"],
    "dhikr_time": "For those seeking financial abundance and a broad, open heart.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 46,
    "name_ar": "ٱلْحَكِيمُ",
    "transliteration": "Al-Ḥakīm",
    "translation_en": "The All-Wise",
    "translation_bn": "প্রজ্ঞাময়",
    "description": "The one whose actions and decrees are based on perfect wisdom. He places everything in its proper place.",
    "benefit": "Recitation helps in overcoming difficulties in work and increases wisdom.",
    "dua": "Yā Ḥakīm, grant me wisdom to understand Your decree and to navigate the challenges of life.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "269",
      "text_ar": "وَمَن يُؤْتَ ٱلْحِكْمَةَ فَقَدْ أُوتِىَ خَيْرًا كَثِيرًا",
      "text_en": "and whoever is given wisdom is certainly given much good."
    },
    "audio_url": "https://yourcdn.com/audio/al-hakim.mp3",
    "tags": ["Wisdom", "Judgment", "Perfection"],
    "recitation_count": {
      "recommended": 78,
      "reward": "The reciter's difficulties will be removed and they will be blessed with wisdom."
    },
    "daily_tip": "Before reacting to a problem, pause and ask Al-Ḥakīm to guide you to a wise response.",
    "reflections": [
      "Nothing happens randomly. There is a perfect wisdom behind every event, even if I don't understand it.",
      "This name brings profound peace and acceptance (rida) with the decree of Allah."
    ],
    "related_names": ["Al-'Alīm", "Al-Khabīr", "Al-Ḥakam"],
    "dhikr_time": "When a task becomes difficult or when seeking wisdom for a decision.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 47,
    "name_ar": "ٱلْوَدُودُ",
    "transliteration": "Al-Wadūd",
    "translation_en": "The Loving One",
    "translation_bn": "প্রেমময়",
    "description": "The one who possesses a special, manifest love for His righteous servants. He is the source of all love and affection.",
    "benefit": "Recitation can resolve disputes and create love and affection between people.",
    "dua": "Yā Wadūd, place love for You in my heart above all else, and place love between me and the righteous.",
    "quran_reference": {
      "surah": "Hud",
      "verse": "90",
      "text_ar": "إِنَّ رَبِّى رَحِيمٌ وَدُودٌ",
      "text_en": "Indeed, my Lord is Merciful and Affectionate."
    },
    "audio_url": "https://yourcdn.com/audio/al-wadud.mp3",
    "tags": ["Love", "Affection", "Friendship"],
    "recitation_count": {
      "recommended": 1000,
      "reward": "Reciting over food and sharing it can resolve disagreements between people."
    },
    "daily_tip": "Express your love to your family and friends today for the sake of Allah.",
    "reflections": [
      "This is not just any love; it's an active, expressive love. It's a beautiful, intimate name.",
      "To be loved by the Lord of the worlds is the highest possible honor."
    ],
    "related_names": ["Ar-Raḥmān", "Ar-Raḥīm", "Ar-Ra'ūf"],
    "dhikr_time": "To create love and harmony in the family or to resolve a dispute.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 48,
    "name_ar": "ٱلْمَجِيدُ",
    "transliteration": "Al-Majīd",
    "translation_en": "The Glorious",
    "translation_bn": "মহিমান্বিত",
    "description": "The one who is the most glorious and honorable. His glory is manifest in His noble deeds and magnificent attributes.",
    "benefit": "Recitation can cure illnesses like leprosy and brings honor.",
    "dua": "Yā Majīd, grant me a share of Your glory through piety and good character.",
    "quran_reference": {
      "surah": "Hud",
      "verse": "73",
      "text_ar": "إِنَّهُۥ حَمِيدٌ مَّجِيدٌ",
      "text_en": "Indeed, He is Praiseworthy and Glorious."
    },
    "audio_url": "https://yourcdn.com/audio/al-majid.mp3",
    "tags": ["Glory", "Honor", "Nobility"],
    "recitation_count": {
      "recommended": 57,
      "reward": "The reciter will be cured from diseases and will be respected."
    },
    "daily_tip": "Read the Quran with reverence, as it is the 'Qur'an-il-Majīd' (The Glorious Quran), a manifestation of His glory.",
    "reflections": [
      "While Al-Jalīl relates to the majesty of His essence, Al-Majīd relates to the glory of His actions and generosity.",
      "His glory is a combination of His greatness and His immense kindness."
    ],
    "related_names": ["Al-Jalīl", "Al-Karīm", "Al-Ḥamīd"],
    "dhikr_time": "On the 13th, 14th, and 15th of the lunar month for healing.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 49,
    "name_ar": "ٱلْبَاعِثُ",
    "transliteration": "Al-Bā'ith",
    "translation_en": "The Resurrector",
    "translation_bn": "পুনরুত্থানকারী",
    "description": "The one who will resurrect all of mankind from death on the Day of Judgment. He also sends messengers and awakens hearts.",
    "benefit": "Recitation instills the fear of Allah and leads to piety.",
    "dua": "Yā Bā'ith, resurrect me on the Day of Judgment among the righteous and awaken my heart from the slumber of heedlessness.",
    "quran_reference": {
      "surah": "Al-Hajj",
      "verse": "7",
      "text_ar": "وَأَنَّ ٱللَّهَ يَبْعَثُ مَن فِى ٱلْقُبُورِ",
      "text_en": "and because Allah will resurrect those in the graves."
    },
    "audio_url": "https://yourcdn.com/audio/al-baith.mp3",
    "tags": ["Resurrection", "Awakening", "Judgment Day"],
    "recitation_count": {
      "recommended": 573,
      "reward": "The reciter will gain God-consciousness and wisdom."
    },
    "daily_tip": "Remember that you will be resurrected and will have to account for your deeds. Live accordingly.",
    "reflections": [
      "This name is a cornerstone of faith. Belief in resurrection changes one's entire outlook on life.",
      "Just as He can resurrect the dead, He can resurrect a dead heart and give it life."
    ],
    "related_names": ["Al-Muḥyī", "Al-Mu'īd", "Al-Jāmi'"],
    "dhikr_time": "Before sleeping, with hand on the chest, to gain piety.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 50,
    "name_ar": "ٱلْشَّهِيدُ",
    "transliteration": "Ash-Shahīd",
    "translation_en": "The Witness",
    "translation_bn": "প্রত্যক্ষদর্শী",
    "description": "The one who is the ultimate witness to all things. He is present and witnesses every action, thought, and event everywhere.",
    "benefit": "Recitation can help in making a disobedient child or spouse righteous.",
    "dua": "Yā Shahīd, make me conscious that You are a witness over me at all times, and make me a witness for the truth.",
    "quran_reference": {
      "surah": "An-Nisa",
      "verse": "79",
      "text_ar": "وَكَفَىٰ بِٱللَّهِ شَهِيدًا",
      "text_en": "And sufficient is Allah as Witness."
    },
    "audio_url": "https://yourcdn.com/audio/ash-shahid.mp3",
    "tags": ["Witness", "Testimony", "Presence"],
    "recitation_count": {
      "recommended": 319,
      "reward": "The reciter's disobedient child will become obedient."
    },
    "daily_tip": "When you are about to do something in secret, remember that Ash-Shahīd is a witness.",
    "reflections": [
      "While Ar-Raqīb is the watchful observer, Ash-Shahīd is the one who can bear witness on the Day of Judgment because of His presence.",
      "This is both a warning and a comfort. He witnesses my struggles and will bear witness for me if I am wronged."
    ],
    "related_names": ["Ar-Raqīb", "Al-Muhaymin", "Al-Baṣīr", "Al-Khabīr"],
    "dhikr_time": "To help reform a rebellious child.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 51,
    "name_ar": "ٱلْحَقُّ",
    "transliteration": "Al-Ḥaqq",
    "translation_en": "The Truth",
    "translation_bn": "সত্য",
    "description": "The one who is the ultimate truth and reality. His essence is truth, and all truth comes from Him.",
    "benefit": "Recitation helps in finding lost items and in making one firm upon the truth.",
    "dua": "Yā Ḥaqq, show me the truth as truth and grant me the ability to follow it, and show me falsehood as falsehood and grant me the ability to avoid it.",
    "quran_reference": {
      "surah": "Taha",
      "verse": "114",
      "text_ar": "فَتَعَـٰلَى ٱللَّهُ ٱلْمَلِكُ ٱلْحَقُّ",
      "text_en": "So high [above all] is Allah, the Sovereign, the Truth."
    },
    "audio_url": "https://yourcdn.com/audio/al-haqq.mp3",
    "tags": ["Truth", "Reality", "Certainty"],
    "recitation_count": {
      "recommended": 108,
      "reward": "The reciter will recover what was lost."
    },
    "daily_tip": "Speak the truth today, even if it is bitter.",
    "reflections": [
      "In a world of fake news and deception, Al-Ḥaqq is the only anchor of absolute reality.",
      "Islam is called the 'religion of truth' (dīn al-ḥaqq) because it originates from Him."
    ],
    "related_names": ["Al-Mu'min", "An-Nūr", "Al-Hādī"],
    "dhikr_time": "When something is lost or to stay firm on the right path.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 52,
    "name_ar": "ٱلْوَكِيلُ",
    "transliteration": "Al-Wakīl",
    "translation_en": "The Trustee",
    "translation_bn": "কর্মবিধায়ক",
    "description": "The one who is the ultimate trustee and disposer of affairs. He is the one to whom you can entrust all your matters with perfect reliance.",
    "benefit": "Recitation provides protection from all calamities like drowning, fire, or other dangers.",
    "dua": "Yā Wakīl, I entrust my affairs to You. Be my disposer and suffice me against all worries.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "173",
      "text_ar": "وَقَالُوا۟ حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ",
      "text_en": "and they said, 'Sufficient for us is Allah, and [He is] the best Disposer of affairs.'"
    },
    "audio_url": "https://yourcdn.com/audio/al-wakil.mp3",
    "tags": ["Trust", "Reliance", "Disposer of Affairs"],
    "recitation_count": {
      "recommended": 66,
      "reward": "The reciter will be protected from all dangers."
    },
    "daily_tip": "Do your best in your work, and then entrust the results to Al-Wakīl. This is the meaning of Tawakkul.",
    "reflections": [
      "This name frees me from the burden of anxiety. I do my part, and He takes care of the rest.",
      "If the Lord of the worlds is your trustee, what is there to worry about?"
    ],
    "related_names": ["Al-Ḥasīb", "Al-Ḥāfiẓ", "Al-Kāfī (derived)"],
    "dhikr_time": "When facing a daunting task or when in fear of natural disasters.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 53,
    "name_ar": "ٱلْقَوِيُّ",
    "transliteration": "Al-Qawīy",
    "translation_en": "The All-Strong",
    "translation_bn": "শক্তিমান",
    "description": "The one who possesses perfect and absolute strength. His strength never wanes, and He is never afflicted by weakness.",
    "benefit": "Recitation helps a weak person overcome a strong enemy.",
    "dua": "Yā Qawīy, grant me strength in my body and my faith to worship You and defend the truth.",
    "quran_reference": {
      "surah": "Adh-Dhariyat",
      "verse": "58",
      "text_ar": "إِنَّ ٱللَّهَ هُوَ ٱلرَّزَّاقُ ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
      "text_en": "Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength."
    },
    "audio_url": "https://yourcdn.com/audio/al-qawiy.mp3",
    "tags": ["Strength", "Power", "Might"],
    "recitation_count": {
      "recommended": 116,
      "reward": "The reciter will be safe from the harm of a powerful enemy."
    },
    "daily_tip": "When you feel weak physically or spiritually, seek strength from Al-Qawīy.",
    "reflections": [
      "All the strength in creation is but a minuscule gift from the All-Strong.",
      "This name gives me courage, knowing that my protector is infinitely stronger than any opponent."
    ],
    "related_names": ["Al-Matin", "Al-'Azīz", "Al-Qahhār"],
    "dhikr_time": "When feeling physically or mentally weak, or when facing a strong adversary.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 54,
    "name_ar": "ٱلْمَتِينُ",
    "transliteration": "Al-Matin",
    "translation_en": "The Firm",
    "translation_bn": "দৃঢ়তাসম্পন্ন",
    "description": "The one who is the most firm and steadfast in His strength. His power is resolute and unchanging.",
    "benefit": "Recitation can help a person with bad habits to reform. It can help a mother wean a child.",
    "dua": "Yā Matīn, make me firm and steadfast upon Your religion.",
    "quran_reference": {
      "surah": "Adh-Dhariyat",
      "verse": "58",
      "text_ar": "ذُو ٱلْقُوَّةِ ٱلْمَتِينُ",
      "text_en": "the firm possessor of strength."
    },
    "audio_url": "https://yourcdn.com/audio/al-matin.mp3",
    "tags": ["Firmness", "Steadfastness", "Strength"],
    "recitation_count": {
      "recommended": 500,
      "reward": "The reciter's difficulties will be resolved and they will overcome their rivals."
    },
    "daily_tip": "Be firm and resolute in your good intentions and decisions today.",
    "reflections": [
      "While Al-Qawīy is about the essence of strength, Al-Matīn is about its intensity and steadfastness.",
      "This name gives me the spiritual resolve to remain firm in my faith, no matter the storms."
    ],
    "related_names": ["Al-Qawīy", "Al-Ḥaqq", "Aṣ-Ṣabūr"],
    "dhikr_time": "When facing difficulties that require endurance and resolve.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 55,
    "name_ar": "ٱلْوَلِيُّ",
    "transliteration": "Al-Walīy",
    "translation_en": "The Protecting Friend",
    "translation_bn": "অভিভাবক",
    "description": "The one who is the loving protector and friend of the believers. He supports and guards them.",
    "benefit": "Recitation can help in making one's spouse obedient and loving. It helps in becoming a friend (wali) of Allah.",
    "dua": "Yā Walīy, be my protecting friend in this life and the next, and guide me to what pleases You.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "257",
      "text_ar": "ٱللَّهُ وَلِىُّ ٱلَّذِينَ ءَامَنُوا۟",
      "text_en": "Allah is the ally of those who believe."
    },
    "audio_url": "https://yourcdn.com/audio/al-waliy.mp3",
    "tags": ["Friend", "Protector", "Ally"],
    "recitation_count": {
      "recommended": 46,
      "reward": "The reciter may become a friend of Allah (Waliullah)."
    },
    "daily_tip": "Do deeds that earn the friendship of Al-Walīy, like following the Sunnah and performing optional prayers.",
    "reflections": [
      "To have the Lord of the worlds as your 'Walīy' is the greatest relationship one could ever have.",
      "This name implies a special closeness and loving support that is reserved for the believers."
    ],
    "related_names": ["Al-Wadūd", "An-Naṣīr", "Al-Muhaymin"],
    "dhikr_time": "To gain the friendship of Allah or to improve a marital relationship.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 56,
    "name_ar": "ٱلْحَمِيدُ",
    "transliteration": "Al-Ḥamīd",
    "translation_en": "The Praiseworthy",
    "translation_bn": "প্রশংসিত",
    "description": "The one who is deserving of all praise, whether He is praised or not. All of creation inherently praises Him.",
    "benefit": "Recitation leads to being loved and praised by people.",
    "dua": "Yā Ḥamīd, make my tongue moist with Your praise and make me among the grateful who praise You in all conditions.",
    "quran_reference": {
      "surah": "Ibrahim",
      "verse": "8",
      "text_ar": "فَإِنَّ ٱللَّهَ لَغَنِىٌّ حَمِيدٌ",
      "text_en": "then indeed, Allah is Free of need and Praiseworthy."
    },
    "audio_url": "https://yourcdn.com/audio/al-hamid.mp3",
    "tags": ["Praise", "Gratitude", "Worthiness"],
    "recitation_count": {
      "recommended": 62,
      "reward": "The reciter will be among those who are praised."
    },
    "daily_tip": "Say 'Alḥamdulillāh' (All praise is for Allah) often today, for both good and seemingly bad occurrences.",
    "reflections": [
      "He is praised for His perfection, even if no one praises Him. Our praise does not benefit Him, but it benefits us.",
      "This name teaches me to praise Him in all circumstances, knowing there is good in every decree."
    ],
    "related_names": ["Ash-Shakūr", "Al-Majīd"],
    "dhikr_time": "Frequently throughout the day to cultivate a state of gratitude.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 57,
    "name_ar": "ٱلْمُحْصِي",
    "transliteration": "Al-Muḥṣī",
    "translation_en": "The Accounter",
    "translation_bn": "হিসাব সংরক্ষণকারী",
    "description": "The one who knows and keeps count of every single thing in existence, from the grains of sand to the breaths of every creature.",
    "benefit": "Recitation helps in improving memory and makes the reckoning on the Day of Judgment easier.",
    "dua": "Yā Muḥṣī, You have accounted for all things. Overlook my faults and grant me an easy reckoning.",
    "quran_reference": {
      "surah": "Al-Jinn",
      "verse": "28",
      "text_ar": "وَأَحْصَىٰ كُلَّ شَىْءٍ عَدَدًۢا",
      "text_en": "and He has encompassed whatever is with them and has enumerated all things in number."
    },
    "audio_url": "https://yourcdn.com/audio/al-muhsi.mp3",
    "tags": ["Accountant", "Knower", "Enumerator"],
    "recitation_count": {
      "recommended": 148,
      "reward": "The reciter will find the reckoning on the Day of Judgment to be easy."
    },
    "daily_tip": "Be mindful of your deeds, big and small, because Al-Muḥṣī is counting everything.",
    "reflections": [
      "The sheer scale of this attribute is incomprehensible. He has counted every leaf that falls.",
      "This name instills a profound sense of awe and accountability."
    ],
    "related_names": ["Al-Ḥasīb", "Al-'Alīm", "Al-Khabīr"],
    "dhikr_time": "For someone with a weak memory or fear of the Day of Judgment.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 58,
    "name_ar": "ٱلْمُبْدِئُ",
    "transliteration": "Al-Mubdi'",
    "translation_en": "The Originator",
    "translation_bn": "সূচনাকারী",
    "description": "The one who initiated all of creation from nothing. He is the beginner of all things.",
    "benefit": "Recitation can provide safety and reassurance to a pregnant woman who fears miscarriage.",
    "dua": "Yā Mubdi', as You originated this creation, originate good for me in all my affairs.",
    "quran_reference": {
      "surah": "Al-Buruj",
      "verse": "13",
      "text_ar": "إِنَّهُۥ هُوَ يُبْدِئُ وَيُعِيدُ",
      "text_en": "Indeed, it is He who originates [creation] and repeats."
    },
    "audio_url": "https://yourcdn.com/audio/al-mubdi.mp3",
    "tags": ["Originator", "Beginner", "Initiator"],
    "recitation_count": {
      "recommended": 56,
      "reward": "A pregnant woman will be safe from harm or premature birth."
    },
    "daily_tip": "When starting a new project, begin with the name of Al-Mubdi', the one who originates all things.",
    "reflections": [
      "This name should be considered with its counterpart, Al-Mu'īd (The Restorer). He who began creation can surely repeat it.",
      "It reminds me of the miracle of the beginning of the universe and the beginning of my own life."
    ],
    "related_names": ["Al-Mu'īd", "Al-Khāliq", "Al-Badī'"],
    "dhikr_time": "In the morning or when a pregnant woman is fearful.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 59,
    "name_ar": "ٱلْمُعِيدُ",
    "transliteration": "Al-Mu'īd",
    "translation_en": "The Restorer",
    "translation_bn": "পুনঃসৃষ্টিকারী",
    "description": "The one who restores and repeats creation after its demise. He will bring all things back to life.",
    "benefit": "Recitation can help in remembering something that has been forgotten or in finding a person who is lost.",
    "dua": "Yā Mu'īd, restore to me what I have lost and reunite me with my loved ones.",
    "quran_reference": {
      "surah": "Al-Buruj",
      "verse": "13",
      "text_ar": "إِنَّهُۥ هُوَ يُبْدِئُ وَيُعِيدُ",
      "text_en": "Indeed, it is He who originates [creation] and repeats."
    },
    "audio_url": "https://yourcdn.com/audio/al-muid.mp3",
    "tags": ["Restorer", "Repeater", "Resurrection"],
    "recitation_count": {
      "recommended": 124,
      "reward": "A lost person will return home safely."
    },
    "daily_tip": "If you forget something, ask Al-Mu'īd to help you recall it.",
    "reflections": [
      "This name is a proof for the resurrection. The one who did it the first time (Al-Mubdi') can easily do it again.",
      "He can restore not just life, but also health, wealth, and relationships."
    ],
    "related_names": ["Al-Mubdi'", "Al-Bā'ith"],
    "dhikr_time": "When someone is missing or something is forgotten.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 60,
    "name_ar": "ٱلْمُحْيِى",
    "transliteration": "Al-Muḥyī",
    "translation_en": "The Giver of Life",
    "translation_bn": "জীবনদানকারী",
    "description": "The one who gives life to all things, from a barren land to a lifeless body.",
    "benefit": "Recitation can bring relief from a heavy burden or sickness.",
    "dua": "Yā Muḥyī, give life to my heart with the light of faith and knowledge.",
    "quran_reference": {
      "surah": "Ar-Rum",
      "verse": "50",
      "text_ar": "فَٱنظُرْ إِلَىٰٓ ءَاثَـٰرِ رَحْمَتِ ٱللَّهِ كَيْفَ يُحْىِ ٱلْأَرْضَ بَعْدَ مَوْتِهَآ إِنَّ ذَٰلِكَ لَمُحْىِ ٱلْمَوْتَىٰ",
      "text_en": "So observe the effects of the mercy of Allah - how He gives life to the earth after its lifelessness. Indeed, that [same one] will give life to the dead."
    },
    "audio_url": "https://yourcdn.com/audio/al-muhyi.mp3",
    "tags": ["Life-Giver", "Reviver", "Healer"],
    "recitation_count": {
      "recommended": 68,
      "reward": "The reciter will be helped in their difficulties and will be granted healing if sick."
    },
    "daily_tip": "When you see rain bringing a dry land back to life, remember Al-Muḥyī.",
    "reflections": [
      "This is paired with Al-Mumīt (The Taker of Life). He alone controls the circle of life and death.",
      "Just as He gives life to the earth, He can give life to a heart that has become dead from sin."
    ],
    "related_names": ["Al-Mumīt", "Al-Bā'ith", "Al-Khāliq"],
    "dhikr_time": "For a sick person or someone feeling spiritually dead.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 61,
    "name_ar": "ٱلْمُمِيتُ",
    "transliteration": "Al-Mumīt",
    "translation_en": "The Taker of Life",
    "translation_bn": "মৃত্যুদানকারী",
    "description": "The one who ordains death for all living things. He is the ultimate cause of death.",
    "benefit": "Recitation helps in gaining control over one's lower self (nafs).",
    "dua": "Yā Mumīt, grant me death only when You are pleased with me, upon a state of faith.",
    "quran_reference": {
      "surah": "Al-Mulk",
      "verse": "2",
      "text_ar": "ٱلَّذِى خَلَقَ ٱلْمَوْتَ وَٱلْحَيَوٰةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا",
      "text_en": "He who created death and life to test you [as to] which of you is best in deed."
    },
    "audio_url": "https://yourcdn.com/audio/al-mumit.mp3",
    "tags": ["Death-Bringer", "Life", "Death"],
    "recitation_count": {
      "recommended": 490,
      "reward": "The reciter will be able to conquer their desires and rebellious nafs."
    },
    "daily_tip": "Remember death often, for it is the destroyer of worldly pleasures and encourages preparation for the hereafter.",
    "reflections": [
      "This is the counterpart to Al-Muḥyī. Life and death are entirely in His hands.",
      "This name is not meant to be morbid, but to be a reminder of the temporary nature of this life, urging me to focus on what is permanent."
    ],
    "related_names": ["Al-Muḥyī", "Al-Bā'ith"],
    "dhikr_time": "When struggling with worldly temptations or desires.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 62,
    "name_ar": "ٱلْحَىُّ",
    "transliteration": "Al-Ḥayy",
    "translation_en": "The Ever-Living",
    "translation_bn": "চিরঞ্জীব",
    "description": "The one who is eternally alive and whose life is perfect and unchanging. He is the source of all life.",
    "benefit": "Recitation can lead to a long and healthy life and recovery from illness.",
    "dua": "Yā Ḥayy, O Ever-Living, by Your mercy I seek assistance.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "255",
      "text_ar": "ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ",
      "text_en": "Allah - there is no deity except Him, the Ever-Living, the Sustainer of [all] existence."
    },
    "audio_url": "https://yourcdn.com/audio/al-hayy.mp3",
    "tags": ["Life", "Eternal", "Ever-Living"],
    "recitation_count": {
      "recommended": 18,
      "reward": "The reciter will not suffer from illness and will have a long life."
    },
    "daily_tip": "When feeling down, call upon Al-Ḥayy Al-Qayyūm to manage your affairs.",
    "reflections": [
      "Every living thing dies, but He is the Ever-Living who never dies.",
      "His life is perfect, not needing sleep, food, or rest like our deficient lives."
    ],
    "related_names": ["Al-Qayyūm", "Al-Bāqī", "Al-Muḥyī"],
    "dhikr_time": "When sick or for general vitality and well-being.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 63,
    "name_ar": "ٱلْقَيُّومُ",
    "transliteration": "Al-Qayyūm",
    "translation_en": "The Self-Sustaining",
    "translation_bn": "সর্বসত্তার ধারক",
    "description": "The one who is self-existing and by whom all things subsist. The entire universe depends on Him for its existence.",
    "benefit": "Recitation prevents one from falling into heedlessness and brings respect.",
    "dua": "Yā Qayyūm, O Self-Sustaining, rectify all my affairs for me and do not leave me to myself even for the blink of an eye.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "255",
      "text_ar": "ٱلْحَىُّ ٱلْقَيُّومُ",
      "text_en": "the Ever-Living, the Sustainer of [all] existence."
    },
    "audio_url": "https://yourcdn.com/audio/al-qayyum.mp3",
    "tags": ["Self-Sustaining", "Eternal", "Foundation"],
    "recitation_count": {
      "recommended": 156,
      "reward": "The reciter will not fall into negligence and will be honored."
    },
    "daily_tip": "Realize your complete dependence on Al-Qayyūm for your every breath and heartbeat.",
    "reflections": [
      "He needs no one and nothing, while everyone and everything needs Him at every moment.",
      "This name, often paired with Al-Ḥayy, forms 'Al-Ism Al-A'ẓam' (The Greatest Name) according to some scholars."
    ],
    "related_names": ["Al-Ḥayy", "Aṣ-Ṣamad", "Al-Ghanī"],
    "dhikr_time": "After Fajr until sunrise to avoid lethargy, or when feeling overwhelmed.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 64,
    "name_ar": "ٱلْوَاجِدُ",
    "transliteration": "Al-Wājid",
    "translation_en": "The Perceiver",
    "translation_bn": "অবধারক",
    "description": "The one who finds and perceives whatever He wills. He lacks nothing and nothing is lost to Him.",
    "benefit": "Recitation can lead to richness of the heart and contentment.",
    "dua": "Yā Wājid, help me find what is good for me and make me content with what I have.",
    "quran_reference": {
      "surah": "Ad-Duhaa",
      "verse": "7",
      "text_ar": "وَوَجَدَكَ ضَآلًّا فَهَدَىٰ",
      "text_en": "And He found you lost and guided [you],"
    },
    "audio_url": "https://yourcdn.com/audio/al-wajid.mp3",
    "tags": ["Perceiver", "Finder", "Richness"],
    "recitation_count": {
      "recommended": 14,
      "reward": "The reciter will be blessed with wealth of the heart."
    },
    "daily_tip": "When you eat, reflect on this name to develop richness of the heart.",
    "reflections": [
      "He finds the lost and guides them. He perceives every need and fulfills it.",
      "Unlike us who are always searching and lacking, He is the one who finds and lacks nothing."
    ],
    "related_names": ["Al-Ghanī", "Al-Ḥaqq"],
    "dhikr_time": "To cultivate inner wealth and contentment.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 65,
    "name_ar": "ٱلْمَاجِدُ",
    "transliteration": "Al-Mājid",
    "translation_en": "The Illustrious",
    "translation_bn": "মহান",
    "description": "The one who is most illustrious, dignified, and noble. His nobility is manifest in His abundant blessings.",
    "benefit": "Recitation enlightens the heart.",
    "dua": "Yā Mājid, illuminate my heart with Your light and make me noble in character.",
    "quran_reference": {
      "surah": "Al-Buruj",
      "verse": "15",
      "text_ar": "ذُو ٱلْعَرْشِ ٱلْمَجِيدُ",
      "text_en": "Honorable Owner of the Throne,"
    },
    "audio_url": "https://yourcdn.com/audio/al-majid-2.mp3",
    "tags": ["Illustrious", "Dignity", "Nobility"],
    "recitation_count": {
      "recommended": 48,
      "reward": "The reciter will gain spiritual radiance."
    },
    "daily_tip": "Act with dignity and nobility today, reflecting the qualities of one who worships Al-Mājid.",
    "reflections": [
      "This name is very similar to Al-Majīd, emphasizing nobility, honor, and glory.",
      "The repetition of similar names highlights the importance and different nuances of that attribute."
    ],
    "related_names": ["Al-Majīd", "Al-Karīm", "Al-Jalīl"],
    "dhikr_time": "In seclusion, to achieve enlightenment of the heart.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 66,
    "name_ar": "ٱلْوَاحِدُ",
    "transliteration": "Al-Wāḥid",
    "translation_en": "The One",
    "translation_bn": "এক",
    "description": "The one who is unique, the single, indivisible entity. He is One in His essence, attributes, and actions.",
    "benefit": "Recitation helps remove the fear of creation from the heart and provides relief from loneliness.",
    "dua": "Yā Wāḥid, purify my heart from any hidden shirk and make my devotion for You alone.",
    "quran_reference": {
      "surah": "Ar-Ra'd",
      "verse": "16",
      "text_ar": "وَهُوَ ٱلْوَٰحِدُ ٱلْقَهَّـٰرُ",
      "text_en": "and He is the One, the Prevailing."
    },
    "audio_url": "https://yourcdn.com/audio/al-wahid.mp3",
    "tags": ["One", "Unique", "Unity", "Tawhid"],
    "recitation_count": {
      "recommended": 19,
      "reward": "The reciter will be free from fear and delusion."
    },
    "daily_tip": "Unify your focus and intentions today for the sake of The One, Al-Wāḥid.",
    "reflections": [
      "This is the core concept of Islam: Tawhid, the Oneness of Allah.",
      "Contemplating this name frees me from dependence on anyone or anything else."
    ],
    "related_names": ["Al-Aḥad"],
    "dhikr_time": "In solitude, for those who feel lonely or fearful.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 67,
    "name_ar": "ٱلْأَحَدُ",
    "transliteration": "Al-Aḥad",
    "translation_en": "The Unique",
    "translation_bn": "একক",
    "description": "The one who is uniquely One, the sole object of worship. He has no partners, no parents, no offspring. He is absolutely unique.",
    "benefit": "Recitation can lead to the unveiling of divine secrets.",
    "dua": "Yā Aḥad, You are the Unique One. Make me sincere to You alone in all my worship.",
    "quran_reference": {
      "surah": "Al-Ikhlas",
      "verse": "1",
      "text_ar": "قُلْ هُوَ ٱللَّهُ أَحَدٌ",
      "text_en": "Say, 'He is Allah, [who is] One."
    },
    "audio_url": "https://yourcdn.com/audio/al-ahad.mp3",
    "tags": ["Unique", "One", "Unity", "Tawhid"],
    "recitation_count": {
      "recommended": 1000,
      "reward": "Certain secrets may be revealed to the reciter."
    },
    "daily_tip": "Read Surah Al-Ikhlas with deep reflection on the meaning of Al-Aḥad.",
    "reflections": [
      "While Al-Wāḥid signifies His oneness against 'two' or 'three', Al-Aḥad signifies His absolute, unparalleled uniqueness.",
      "This is the ultimate declaration of monotheism, negating any form of partnership with Allah."
    ],
    "related_names": ["Al-Wāḥid", "Aṣ-Ṣamad"],
    "dhikr_time": "In solitude, to deepen one's understanding of Tawhid.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 68,
    "name_ar": "ٱلْصَّمَدُ",
    "transliteration": "Aṣ-Ṣamad",
    "translation_en": "The Eternal",
    "translation_bn": "অমুখাপেক্ষী",
    "description": "The one who is the eternal refuge, on whom all of creation depends, yet He depends on no one.",
    "benefit": "Recitation helps in fulfilling one's needs and provides relief from hunger.",
    "dua": "Yā Ṣamad, I turn to You for all my needs. Fulfill them from Your endless treasury.",
    "quran_reference": {
      "surah": "Al-Ikhlas",
      "verse": "2",
      "text_ar": "ٱللَّهُ ٱلصَّمَدُ",
      "text_en": "Allah, the Eternal Refuge."
    },
    "audio_url": "https://yourcdn.com/audio/as-samad.mp3",
    "tags": ["Eternal", "Self-Sufficient", "Refuge"],
    "recitation_count": {
      "recommended": 134,
      "reward": "Allah will make the reciter independent of others."
    },
    "daily_tip": "When you need something, turn your heart first to Aṣ-Ṣamad, the only one who can truly fulfill it.",
    "reflections": [
      "He is the master to whom one turns in need. This name directs all my hopes and requests to Him alone.",
      "He is not hollow; He is solid, eternal, the ultimate source to satisfy all needs."
    ],
    "related_names": ["Al-Ghanī", "Al-Qayyūm", "Al-Aḥad"],
    "dhikr_time": "In the last part of the night, in prostration, to have needs fulfilled.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 69,
    "name_ar": "ٱلْقَادِرُ",
    "transliteration": "Al-Qādir",
    "translation_en": "The Able",
    "translation_bn": "ক্ষমতাবান",
    "description": "The one who has the perfect power and ability to do whatever He wills.",
    "benefit": "Recitation helps in making difficult tasks easy and provides strength.",
    "dua": "Yā Qādir, by Your perfect ability, make my difficult tasks easy for me.",
    "quran_reference": {
      "surah": "Al-An'am",
      "verse": "65",
      "text_ar": "قُلْ هُوَ ٱلْقَادِرُ عَلَىٰٓ أَن يَبْعَثَ عَلَيْكُمْ عَذَابًا",
      "text_en": "Say, 'He is the [one] Able to send upon you affliction...'"
    },
    "audio_url": "https://yourcdn.com/audio/al-qadir.mp3",
    "tags": ["Power", "Ability", "Capability"],
    "recitation_count": {
      "recommended": 305,
      "reward": "The reciter's desires will be fulfilled."
    },
    "daily_tip": "When you feel incapable of handling a situation, remember you can seek help from Al-Qādir.",
    "reflections": [
      "This name emphasizes His inherent capability. He doesn't need to acquire power; it is an intrinsic part of His being.",
      "It reminds me of my own powerlessness and His absolute power."
    ],
    "related_names": ["Al-Muqtadir", "Al-Qawīy"],
    "dhikr_time": "After two rak'ah of prayer, for success in a task.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 70,
    "name_ar": "ٱلْمُقْتَدِرُ",
    "transliteration": "Al-Muqtadir",
    "translation_en": "The All-Powerful",
    "translation_bn": "সার্বভৌম",
    "description": "The one whose power is supreme and who has absolute authority over all things.",
    "benefit": "Recitation helps one to be aware of the truth and reality of things.",
    "dua": "Yā Muqtadir, by Your supreme power, guide my affairs and protect me from my own shortcomings.",
    "quran_reference": {
      "surah": "Al-Qamar",
      "verse": "55",
      "text_ar": "فِى مَقْعَدِ صِدْقٍ عِندَ مَلِيكٍ مُّقْتَدِرٍۭ",
      "text_en": "In a seat of honor near a Sovereign, Perfect in Ability."
    },
    "audio_url": "https://yourcdn.com/audio/al-muqtadir.mp3",
    "tags": ["Power", "Authority", "Supremacy"],
    "recitation_count": {
      "recommended": 744,
      "reward": "The reciter will awaken from a state of heedlessness."
    },
    "daily_tip": "Recognize your own limitations and the supreme power of Allah.",
    "reflections": [
      "Al-Muqtadir is an intensified form of Al-Qādir, highlighting supreme and unopposed power.",
      "This name instills awe and humility, knowing that ultimate control belongs to Him alone."
    ],
    "related_names": ["Al-Qādir", "Al-Malik", "Al-Qahhār"],
    "dhikr_time": "After waking up from sleep.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 71,
    "name_ar": "ٱلْمُقَدِّمُ",
    "transliteration": "Al-Muqaddim",
    "translation_en": "The Promoter",
    "translation_bn": "অগ্রবর্তীকারী",
    "description": "The one who brings forward or promotes whom He wills.",
    "benefit": "Recitation in the battlefield provides safety and courage. It helps in progressing in righteous endeavors.",
    "dua": "Yā Muqaddim, bring me forward in acts of obedience and closeness to You.",
    "quran_reference": {
      "surah": "An-Nahl",
      "verse": "61",
      "text_ar": "فَإِذَا جَآءَ أَجَلُهُمْ لَا يَسْتَـْٔخِرُونَ سَاعَةً وَلَا يَسْتَقْدِمُونَ",
      "text_en": "And when their term has come, they will not remain behind an hour, nor will they precede [it]."
    },
    "audio_url": "https://yourcdn.com/audio/al-muqaddim.mp3",
    "tags": ["Advancement", "Promotion", "Precedence"],
    "recitation_count": {
      "recommended": 184,
      "reward": "The reciter will become obedient to Allah and will progress spiritually."
    },
    "daily_tip": "Prioritize your religious duties today. Put Allah first.",
    "reflections": [
      "Allah promotes whom He wills based on His perfect wisdom, not our desires.",
      "This name teaches me to strive for progress in my faith and not to lag behind."
    ],
    "related_names": ["Al-Mu'akhkhir", "Ar-Rāfi'", "Al-Awwal"],
    "dhikr_time": "When seeking progress in a task or in the battlefield.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 72,
    "name_ar": "ٱلْمُؤَخِّرُ",
    "transliteration": "Al-Mu'akhkhir",
    "translation_en": "The Delayer",
    "translation_bn": "বিলম্বকারী",
    "description": "The one who delays or puts back whom He wills.",
    "benefit": "Frequent recitation leads to sincere repentance and closeness to Allah.",
    "dua": "Yā Mu'akhkhir, delay my punishment for my sins and grant me time to repent sincerely.",
    "quran_reference": {
      "surah": "An-Nahl",
      "verse": "61",
      "text_ar": "فَإِذَا جَآءَ أَجَلُهُمْ لَا يَسْتَـْٔخِرُونَ سَاعَةً وَلَا يَسْتَقْدِمُونَ",
      "text_en": "And when their term has come, they will not remain behind an hour, nor will they precede [it]."
    },
    "audio_url": "https://yourcdn.com/audio/al-muakhkhir.mp3",
    "tags": ["Delay", "Postponement", "Reprieve"],
    "recitation_count": {
      "recommended": 100,
      "reward": "The reciter will gain closeness to Allah and will not be attached to the world."
    },
    "daily_tip": "Do not delay today's good deeds until tomorrow.",
    "reflections": [
      "There is wisdom in Allah's delay. Sometimes a delay is a protection or a means of preparation.",
      "This name teaches me patience and trust in Allah's perfect timing."
    ],
    "related_names": ["Al-Muqaddim", "Al-Khāfiḍ", "Al-Halīm"],
    "dhikr_time": "To encourage repentance and detachment from worldly things.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 73,
    "name_ar": "ٱلْأَوَّلُ",
    "transliteration": "Al-Awwal",
    "translation_en": "The First",
    "translation_bn": "প্রথম",
    "description": "He who is the First, existing before all of creation. There was nothing before Him.",
    "benefit": "Reciting it can help in starting tasks successfully and for the fulfillment of needs, especially for those desiring a child.",
    "dua": "Yā Awwal, You are the First with none before You. Help me begin my deeds in Your name and for Your sake.",
    "quran_reference": {
      "surah": "Al-Hadid",
      "verse": "3",
      "text_ar": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ",
      "text_en": "He is the First and the Last."
    },
    "audio_url": "https://yourcdn.com/audio/al-awwal.mp3",
    "tags": ["Beginning", "Eternity", "Origin"],
    "recitation_count": {
      "recommended": 37,
      "reward": "Helps in achieving one's objectives and desires."
    },
    "daily_tip": "Start your day by remembering Allah, the First, before all else.",
    "reflections": [
      "Everything has a beginning, but Allah is before all beginnings.",
      "This name gives me perspective that my existence is recent and dependent on Him."
    ],
    "related_names": ["Al-Ākhir", "Aẓ-Ẓāhir", "Al-Bāṭin"],
    "dhikr_time": "When starting a new journey, project, or day.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 74,
    "name_ar": "ٱلْآخِرُ",
    "transliteration": "Al-Ākhir",
    "translation_en": "The Last",
    "translation_bn": "সর্বশেষ",
    "description": "He who is the Last, remaining after all of creation has ceased to exist. There is nothing after Him.",
    "benefit": "Reciting this name leads to a good end of life and purifies one's heart from worldly desires.",
    "dua": "Yā Ākhir, You are the Last with none after You. Grant me a good end and make my last deeds my best deeds.",
    "quran_reference": {
      "surah": "Al-Hadid",
      "verse": "3",
      "text_ar": "هُوَ ٱلْأَوَّلُ وَٱلْـَٔاخِرُ",
      "text_en": "He is the First and the Last."
    },
    "audio_url": "https://yourcdn.com/audio/al-akhir.mp3",
    "tags": ["End", "Eternity", "Everlasting"],
    "recitation_count": {
      "recommended": 100,
      "reward": "The reciter will die with faith (Iman) and lead a good life."
    },
    "daily_tip": "End your day by remembering Allah, seeking forgiveness for your shortcomings.",
    "reflections": [
      "All things will perish except Him. This humbles me and reduces my attachment to the world.",
      "Focusing on the Last reminds me to prepare for the ultimate destination."
    ],
    "related_names": ["Al-Awwal", "Aẓ-Ẓāhir", "Al-Bāṭin", "Al-Wārith"],
    "dhikr_time": "Before going to sleep.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 75,
    "name_ar": "ٱلظَّاهِرُ",
    "transliteration": "Az-Zāhir",
    "translation_en": "The Manifest One",
    "translation_bn": "প্রকাশ্য",
    "description": "The one who is Manifest, whose existence is apparent through countless signs in creation.",
    "benefit": "Recitation after Friday prayer enlightens the heart and improves vision (both physical and spiritual).",
    "dua": "Yā Ẓāhir, make Your signs clear to me and illuminate my heart with Your light.",
    "quran_reference": {
      "surah": "Al-Hadid",
      "verse": "3",
      "text_ar": "وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ",
      "text_en": "the Manifest and the Unseen."
    },
    "audio_url": "https://yourcdn.com/audio/az-zahir.mp3",
    "tags": ["Apparent", "Manifest", "Evident"],
    "recitation_count": {
      "recommended": 15,
      "reward": "The inner self of the reciter will be filled with divine light (Nur)."
    },
    "daily_tip": "See the signs of Allah in the world around you today—in the sun, the trees, and the people.",
    "reflections": [
      "Allah's presence is evident everywhere if I just open my eyes and heart to see.",
      "This name connects the creation to the Creator."
    ],
    "related_names": ["Al-Awwal", "Al-Ākhir", "Al-Bāṭin", "An-Nūr"],
    "dhikr_time": "After Ishraq (post-sunrise) prayer.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 76,
    "name_ar": "ٱلْبَاطِنُ",
    "transliteration": "Al-Bātin",
    "translation_en": "The Hidden One",
    "translation_bn": "গুপ্ত",
    "description": "The one who is Hidden, whose essence is veiled from perception and cannot be comprehended by our senses.",
    "benefit": "Reciting it helps to know the secrets of creation and to have one's needs fulfilled.",
    "dua": "Yā Bātin, protect me from hidden harms and grant me insight into the unseen realities of faith.",
    "quran_reference": {
      "surah": "Al-Hadid",
      "verse": "3",
      "text_ar": "وَٱلظَّـٰهِرُ وَٱلْبَاطِنُ",
      "text_en": "the Manifest and the Unseen."
    },
    "audio_url": "https://yourcdn.com/audio/al-batin.mp3",
    "tags": ["Hidden", "Unseen", "Internal"],
    "recitation_count": {
      "recommended": 33,
      "reward": "Allah will reveal secrets to the reciter and friendship will develop with them."
    },
    "daily_tip": "Focus on improving your inner state today—your intentions and sincerity—which only Allah sees.",
    "reflections": [
      "While His signs are manifest, His true nature is beyond our grasp. This creates a beautiful balance of awe and intimacy.",
      "This teaches me that the most important things, like faith, are unseen."
    ],
    "related_names": ["Al-Awwal", "Al-Ākhir", "Aẓ-Ẓāhir", "Al-Khabīr"],
    "dhikr_time": "During meditation or deep contemplation.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 77,
    "name_ar": "ٱلْوَالِي",
    "transliteration": "Al-Wālī",
    "translation_en": "The Governor",
    "translation_bn": "তত্ত্বাবধায়ক",
    "description": "The sole manager and governor of all of creation, who plans and directs everything.",
    "benefit": "Recitation protects from unexpected calamities. If recited in a new house, it will be safe from dangers.",
    "dua": "Yā Wālī, take charge of my affairs and govern my life according to Your wisdom and pleasure.",
    "quran_reference": {
      "surah": "Ar-Ra'd",
      "verse": "11",
      "text_ar": "وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ",
      "text_en": "and they have not from besides Him any protector."
    },
    "audio_url": "https://yourcdn.com/audio/al-wali.mp3",
    "tags": ["Governor", "Ruler", "Protector"],
    "recitation_count": {
      "recommended": 1000,
      "reward": "The reciter will be protected from all harm and become a friend (wali) of Allah."
    },
    "daily_tip": "Trust that Allah is managing your affairs, even when things seem chaotic.",
    "reflections": [
      "Knowing Allah is the Governor gives me peace. I can let go of the need to control everything.",
      "He governs the entire universe, so surely He can take care of my small worries."
    ],
    "related_names": ["Al-Malik", "Al-Walīy", "Ar-Rabb"],
    "dhikr_time": "On Friday nights or when feeling overwhelmed.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 78,
    "name_ar": "ٱلْمُتَعَالِي",
    "transliteration": "Al-Muta'ālī",
    "translation_en": "The Supremely Exalted",
    "translation_bn": "সর্বোচ্চ মর্যাদাবান",
    "description": "The one who is exalted above all of creation. His highness is beyond the limits of thought.",
    "benefit": "Recitation gains the favor of superiors and helps in overcoming challenges.",
    "dua": "Yā Muta'ālī, elevate my rank in Your sight and protect me from the arrogance of looking down on others.",
    "quran_reference": {
      "surah": "Ar-Ra'd",
      "verse": "9",
      "text_ar": "عَـٰلِمُ ٱلْغَيْبِ وَٱلشَّهَـٰدَةِ ٱلْكَبِيرُ ٱلْمُتَعَالِ",
      "text_en": "Knower of the unseen and the witnessed, the Grand, the Exalted."
    },
    "audio_url": "https://yourcdn.com/audio/al-mutaali.mp3",
    "tags": ["Exalted", "Supreme", "Highness"],
    "recitation_count": {
      "recommended": 541,
      "reward": "Helps in solving difficulties and gaining a higher spiritual or worldly position."
    },
    "daily_tip": "When you achieve something, remember Al-Muta'ālī and remain humble, knowing all success is from Him.",
    "reflections": [
      "No matter how high a created being is, Allah is infinitely higher.",
      "This name cures the disease of arrogance in the heart."
    ],
    "related_names": ["Al-'Alīy", "Al-Kabīr", "Al-Azīm"],
    "dhikr_time": "When seeking promotion or success in a difficult task.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 79,
    "name_ar": "ٱلْبَرُّ",
    "transliteration": "Al-Barr",
    "translation_en": "The Source of All Goodness",
    "translation_bn": "কল্যাণময়",
    "description": "The most kind and gracious source of all virtue and goodness. He is gentle with His servants.",
    "benefit": "Recitation upon a child ensures their protection and righteousness. It increases love for goodness.",
    "dua": "Yā Barr, shower me with Your goodness and make me a source of good for others.",
    "quran_reference": {
      "surah": "At-Tur",
      "verse": "28",
      "text_ar": "إِنَّهُۥ هُوَ ٱلْبَرُّ ٱلرَّحِيمُ",
      "text_en": "Indeed, it is He who is the Beneficent, the Merciful."
    },
    "audio_url": "https://yourcdn.com/audio/al-barr.mp3",
    "tags": ["Goodness", "Virtue", "Kindness"],
    "recitation_count": {
      "recommended": 202,
      "reward": "The reciter will be freed from addiction and their children will be pious."
    },
    "daily_tip": "Do a small act of kindness for your parents today, reflecting the quality of Al-Barr.",
    "reflections": [
      "All good I have ever received or done originates from Him.",
      "This name inspires me to be gentle and kind in my interactions."
    ],
    "related_names": ["Ar-Raḥmān", "Al-Wadūd", "Al-Laṭīf"],
    "dhikr_time": "When praying for the well-being of one's children.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 80,
    "name_ar": "ٱلتَّوَّابُ",
    "transliteration": "At-Tawwāb",
    "translation_en": "The Ever-Acceptor of Repentance",
    "translation_bn": "তওবা কবুলকারী",
    "description": "The one who continuously accepts repentance and forgives sins for those who turn to Him.",
    "benefit": "Frequent recitation makes repentance easy and accepted. Helps overcome oppressive rulers.",
    "dua": "Yā Tawwāb, I turn to You in repentance. Please accept it and cleanse my heart.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "37",
      "text_ar": "إِنَّهُۥ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
      "text_en": "Indeed, it is He who is the Accepting of repentance, the Merciful."
    },
    "audio_url": "https://yourcdn.com/audio/at-tawwab.mp3",
    "tags": ["Repentance", "Forgiveness", "Acceptance"],
    "recitation_count": {
      "recommended": 409,
      "reward": "All undertakings will be successful and repentance will be accepted."
    },
    "daily_tip": "Don't let your sins make you despair. Turn back to At-Tawwāb, for His door is always open.",
    "reflections": [
      "No matter how many times I slip, Allah is ready to accept me back.",
      "This name is a powerful remedy for despair and hopelessness."
    ],
    "related_names": ["Al-Ghafūr", "Al-'Afuww", "Ar-Raḥīm"],
    "dhikr_time": "After committing a sin, or after Duha (mid-morning) prayer.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 81,
    "name_ar": "ٱلْمُنْتَقِمُ",
    "transliteration": "Al-Muntaqim",
    "translation_en": "The Avenger",
    "translation_bn": "প্রতিশোধ গ্রহণকারী",
    "description": "The one who justly delivers retribution to the wrongdoers. His vengeance is rooted in perfect justice.",
    "benefit": "Recitation provides victory against one's enemies and oppressors.",
    "dua": "Yā Muntaqim, protect me from the harm of oppressors and grant me justice.",
    "quran_reference": {
      "surah": "As-Sajdah",
      "verse": "22",
      "text_ar": "إِنَّا مِنَ ٱلْمُجْرِمِينَ مُنتَقِمُونَ",
      "text_en": "Indeed, from the criminals We will take retribution."
    },
    "audio_url": "https://yourcdn.com/audio/al-muntaqim.mp3",
    "tags": ["Justice", "Retribution", "Avenger"],
    "recitation_count": {
      "recommended": 630,
      "reward": "The reciter will be victorious against their enemies if they are on the right."
    },
    "daily_tip": "Instead of seeking personal revenge, entrust your affairs to Al-Muntaqim, the ultimate dispenser of justice.",
    "reflections": [
      "This name is a warning to oppressors and a comfort to the oppressed.",
      "Allah's retribution is not like human anger; it is precise and just."
    ],
    "related_names": ["Al-'Adl", "Al-Ḥakam", "Al-Qahhār"],
    "dhikr_time": "When facing injustice or oppression.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 82,
    "name_ar": "ٱلْعَفُوُّ",
    "transliteration": "Al-'Afuww",
    "translation_en": "The Pardoner",
    "translation_bn": "ক্ষমাকারী",
    "description": "The one who pardons and effaces sins completely, as if they were never committed.",
    "benefit": "Frequent recitation leads to the forgiveness of sins.",
    "dua": "Yā 'Afuww, You are the Pardoner, You love to pardon, so pardon me. (Allāhumma innaka 'afuwwun tuḥibbul-'afwa fa'fu 'annī)",
    "quran_reference": {
      "surah": "An-Nisa",
      "verse": "99",
      "text_ar": "فَإِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا",
      "text_en": "for indeed Allah is ever Pardoning and Forgiving."
    },
    "audio_url": "https://yourcdn.com/audio/al-afuww.mp3",
    "tags": ["Pardon", "Forgiveness", "Erasure"],
    "recitation_count": {
      "recommended": 156,
      "reward": "Allah will forgive the sins of the reciter."
    },
    "daily_tip": "Pardon someone who wronged you today, seeking the pardon of Al-'Afuww.",
    "reflections": [
      "Pardoning ('Afw) is greater than forgiving (Ghafr). It's like the sin is wiped from the record entirely.",
      "This name is especially powerful during the last ten nights of Ramadan."
    ],
    "related_names": ["Al-Ghafūr", "At-Tawwāb", "Ar-Raḥīm"],
    "dhikr_time": "During the Night of Decree (Laylat al-Qadr) and when seeking forgiveness.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 83,
    "name_ar": "ٱلرَّؤُوفُ",
    "transliteration": "Ar-Ra'ūf",
    "translation_en": "The Most Kind",
    "translation_bn": "পরম স্নেহশীল",
    "description": "The one who is extremely kind and compassionate. His kindness prevents His servants from falling into destruction.",
    "benefit": "Recitation instills compassion in one's heart for others. It helps in calming anger.",
    "dua": "Yā Ra'ūf, fill my heart with kindness and compassion for all of Your creation.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "143",
      "text_ar": "إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفٌ رَّحِيمٌ",
      "text_en": "Indeed, Allah is to the people Kind and Merciful."
    },
    "audio_url": "https://yourcdn.com/audio/ar-rauf.mp3",
    "tags": ["Kindness", "Compassion", "Empathy"],
    "recitation_count": {
      "recommended": 287,
      "reward": "The reciter will be blessed with compassion from others, and anger will be subdued."
    },
    "daily_tip": "If you feel angry, recite 'Ya Ra'ūf' to cool down your temper.",
    "reflections": [
      "This is an intense form of mercy, highlighting extreme tenderness and care.",
      "Allah's kindness is a shield that protects us from our own destructive tendencies."
    ],
    "related_names": ["Ar-Raḥīm", "Al-Laṭīf", "Al-Wadūd"],
    "dhikr_time": "When feeling angry or when dealing with a difficult person.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 84,
    "name_ar": "مَالِكُ ٱلْمُلْكِ",
    "transliteration": "Mālik-ul-Mulk",
    "translation_en": "The Owner of All Sovereignty",
    "translation_bn": "সমগ্র রাজ্যের মালিক",
    "description": "The eternal owner of all kingdoms and all sovereignty. He gives and takes authority as He wills.",
    "benefit": "Recitation brings honor, dignity, and financial independence.",
    "dua": "Yā Mālik-ul-Mulk, grant me from Your endless kingdom what is good for me in this life and the next.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "26",
      "text_ar": "قُلِ ٱللَّهُمَّ مَـٰلِكَ ٱلْمُلْكِ",
      "text_en": "Say, 'O Allah, Owner of Sovereignty...'"
    },
    "audio_url": "https://yourcdn.com/audio/malik-ul-mulk.mp3",
    "tags": ["Sovereignty", "Ownership", "Kingdom"],
    "recitation_count": {
      "recommended": 212,
      "reward": "The reciter will be granted wealth and respect."
    },
    "daily_tip": "Remember that your job, house, and possessions are a trust from the true Owner. Be a grateful manager.",
    "reflections": [
      "This name distinguishes between temporary 'kings' on earth and the eternal King of all.",
      "It gives me solace that all power dynamics are ultimately under His control."
    ],
    "related_names": ["Al-Malik", "Al-Ghanī", "Al-Muqtadir"],
    "dhikr_time": "When seeking a new job or position, or for financial stability.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 85,
    "name_ar": "ذُو ٱلْجَلَالِ وَٱلْإِكْرَامِ",
    "transliteration": "Dhul-Jalāli wal-Ikrām",
    "translation_en": "The Lord of Majesty and Honor",
    "translation_bn": "মহিমান্বিত ও মহানুভব",
    "description": "The one who possesses all majesty and glory, and is the source of all honor and generosity.",
    "benefit": "Frequent recitation leads to the fulfillment of all needs and brings reverence.",
    "dua": "Yā Dhul-Jalāli wal-Ikrām, honor me with piety and grant me my needs through Your boundless generosity.",
    "quran_reference": {
      "surah": "Ar-Rahman",
      "verse": "78",
      "text_ar": "تَبَـٰرَكَ ٱسْمُ رَبِّكَ ذِى ٱلْجَلَـٰلِ وَٱلْإِكْرَامِ",
      "text_en": "Blessed is the name of your Lord, Owner of Majesty and Honor."
    },
    "audio_url": "https://yourcdn.com/audio/dhul-jalali-wal-ikram.mp3",
    "tags": ["Majesty", "Honor", "Generosity", "Glory"],
    "recitation_count": {
      "recommended": 1100,
      "reward": "The reciter will achieve honor, dignity, and all their needs will be fulfilled."
    },
    "daily_tip": "Hold fast to this name in your supplications, as the Prophet (PBUH) recommended.",
    "reflections": [
      "This name combines Allah's awesome power (Jalāl) with His beautiful generosity (Ikrām).",
      "It teaches me to approach Allah with both awe and hopeful petition."
    ],
    "related_names": ["Al-Majīd", "Al-Karīm", "Al-Jalīl"],
    "dhikr_time": "Persistently in supplications (Dua).",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 86,
    "name_ar": "ٱلْمُقْسِطُ",
    "transliteration": "Al-Muqsiṭ",
    "translation_en": "The Equitable One",
    "translation_bn": "ন্যায়পরায়ণ",
    "description": "The one who acts with perfect equity and justice. He establishes justice for the oppressed against the oppressor.",
    "benefit": "Recitation helps protect from the whispers of Satan (waswās) and in developing focus.",
    "dua": "Yā Muqsiṭ, grant me the ability to be just and fair in all my dealings and protect me from doubt.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "18",
      "text_ar": "قَآئِمًۢا بِٱلْقِسْطِ",
      "text_en": "maintaining [creation] in justice."
    },
    "audio_url": "https://yourcdn.com/audio/al-muqsit.mp3",
    "tags": ["Equity", "Justice", "Fairness"],
    "recitation_count": {
      "recommended": 209,
      "reward": "The reciter will be free from the whispers of the devil."
    },
    "daily_tip": "Be fair in your dealings today, even if it is against your own interest.",
    "reflections": [
      "While Al-'Adl is about absolute justice, Al-Muqsiṭ is about ensuring equity and restoring rights.",
      "This name gives hope to those who have been wronged that their rights will be restored."
    ],
    "related_names": ["Al-'Adl", "Al-Ḥakam"],
    "dhikr_time": "When plagued by distracting or evil thoughts.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 87,
    "name_ar": "ٱلْجَامِعُ",
    "transliteration": "Al-Jāmi'",
    "translation_en": "The Gatherer",
    "translation_bn": "একত্রকারী",
    "description": "The one who gathers all of creation on the Day of Judgment. He also gathers things together.",
    "benefit": "Recitation helps find lost items or unite with a person one is separated from.",
    "dua": "Yā Jāmi', gather for me all that is good and unite me with my loved ones in this life and the next.",
    "quran_reference": {
      "surah": "Aal-E-Imran",
      "verse": "9",
      "text_ar": "إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادَ",
      "text_en": "Indeed, Allah is the Gatherer of mankind for a Day about which there is no doubt."
    },
    "audio_url": "https://yourcdn.com/audio/al-jami.mp3",
    "tags": ["Gathering", "Unity", "Reunion"],
    "recitation_count": {
      "recommended": 114,
      "reward": "Helps in finding what is lost and creating harmony in the family."
    },
    "daily_tip": "Work to unite people for a good cause today, reflecting the quality of Al-Jāmi'.",
    "reflections": [
      "Just as He will gather all of humanity, He can gather the scattered pieces of my life.",
      "This name reminds me of the inevitability of the Day of Judgment."
    ],
    "related_names": ["Al-Ḥashīr", "Al-Mu'īd"],
    "dhikr_time": "When searching for something lost or to reconcile with someone.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 88,
    "name_ar": "ٱلْغَنِيُّ",
    "transliteration": "Al-Ghanī",
    "translation_en": "The Self-Sufficient",
    "translation_bn": "অমুখাপেক্ষী",
    "description": "The one who is completely independent and free of all needs. All of creation is in absolute need of Him.",
    "benefit": "Recitation brings contentment, blessings in wealth, and freedom from greed.",
    "dua": "Yā Ghanī, enrich me with reliance on You alone and make me content with what You provide.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "267",
      "text_ar": "وَٱعْلَمُوٓا۟ أَنَّ ٱللَّهَ غَنِىٌّ حَمِيدٌ",
      "text_en": "And know that Allah is Free of need and Praiseworthy."
    },
    "audio_url": "https://yourcdn.com/audio/al-ghani.mp3",
    "tags": ["Richness", "Independence", "Self-Sufficient"],
    "recitation_count": {
      "recommended": 1060,
      "reward": "The reciter will be blessed with contentment and will not be greedy."
    },
    "daily_tip": "Give charity today, knowing that your wealth decreases not from giving, as you are asking from the All-Sufficient.",
    "reflections": [
      "Everyone and everything is poor in relation to Allah. This is a humbling realization.",
      "True wealth is not needing anyone or anything besides Al-Ghanī."
    ],
    "related_names": ["Al-Mughnī", "Al-Karīm", "Al-Wāsi'"],
    "dhikr_time": "When seeking financial ease and richness of the heart.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 89,
    "name_ar": "ٱلْمُغْنِي",
    "transliteration": "Al-Mughnī",
    "translation_en": "The Enricher",
    "translation_bn": "ঐশ্বর্যদানকারী",
    "description": "The one who enriches His servants and provides them with all they need.",
    "benefit": "Recitation helps in overcoming poverty and achieving financial and spiritual wealth.",
    "dua": "Yā Mughnī, enrich me from Your bounty so that I may not need to ask from anyone but You.",
    "quran_reference": {
      "surah": "An-Najm",
      "verse": "48",
      "text_ar": "وَأَنَّهُۥ هُوَ أَغْنَىٰ وَأَقْنَىٰ",
      "text_en": "And that it is He who enriches and suffices."
    },
    "audio_url": "https://yourcdn.com/audio/al-mughni.mp3",
    "tags": ["Enrichment", "Wealth", "Sufficiency"],
    "recitation_count": {
      "recommended": 1100,
      "reward": "The reciter will be granted spiritual and material wealth."
    },
    "daily_tip": "When you receive your salary or any provision, thank Al-Mughnī, the true provider.",
    "reflections": [
      "He is not only rich Himself (Al-Ghanī), but He is the one who makes others rich.",
      "This name gives me hope in times of financial difficulty."
    ],
    "related_names": ["Al-Ghanī", "Ar-Razzāq", "Al-Wahhāb"],
    "dhikr_time": "After Friday prayers or when in financial need.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 90,
    "name_ar": "ٱلْمَانِعُ",
    "transliteration": "Al-Māni'",
    "translation_en": "The Withholder",
    "translation_bn": "প্রতিরোধকারী",
    "description": "The one who withholds or prevents things to protect His servants or for a greater wisdom.",
    "benefit": "Recitation helps in ending disputes and protecting from harm.",
    "dua": "Yā Māni', withhold from me all that is harmful and protect me from evil.",
    "quran_reference": {
      "surah": "Al-Mulk",
      "verse": "21",
      "text_ar": "أَمَّنْ هَـٰذَا ٱلَّذِى يَرْزُقُكُمْ إِنْ أَمْسَكَ رِزْقَهُۥ",
      "text_en": "Or who is it that could provide for you if He withheld His provision?"
    },
    "audio_url": "https://yourcdn.com/audio/al-mani.mp3",
    "tags": ["Withholder", "Protector", "Prevention"],
    "recitation_count": {
      "recommended": 161,
      "reward": "Brings about harmony between spouses and protects from all harms."
    },
    "daily_tip": "If something you wanted is withheld from you, trust that Al-Māni' has prevented it for a reason that is ultimately good for you.",
    "reflections": [
      "His withholding is a form of giving. He prevents harm and tests us for our own good.",
      "This name teaches me to trust in His divine plan, whether He gives or withholds."
    ],
    "related_names": ["Aḍ-Ḍārr", "An-Nāfi'", "Al-Qābiḍ"],
    "dhikr_time": "When wanting to stop a bad habit or prevent a family quarrel.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 91,
    "name_ar": "ٱلضَّارُّ",
    "transliteration": "Aḍ-Ḍārr",
    "translation_en": "The Distresser",
    "translation_bn": "অনিষ্টকারী",
    "description": "The one who creates harm or distress, as a means of testing, justice, or for a wisdom known only to Him. (This name is recited with An-Nāfi').",
    "benefit": "Recitation on Friday nights can grant safety from harm and elevate one's status.",
    "dua": "Yā Ḍārr, Yā Nāfi', protect me from the harm I can't bear and turn every trial into a benefit for me.",
    "quran_reference": {
      "surah": "Al-An'am",
      "verse": "17",
      "text_ar": "وَإِن يَمْسَسْكَ ٱللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَ",
      "text_en": "And if Allah should touch you with adversity, there is no remover of it except Him."
    },
    "audio_url": "https://yourcdn.com/audio/ad-darr.mp3",
    "tags": ["Distress", "Harm", "Trial", "Balance"],
    "recitation_count": {
      "recommended": 1001,
      "reward": "The reciter will be safe from physical and spiritual harm."
    },
    "daily_tip": "Recognize that both hardship (ḍurr) and ease (naf') are from Allah and are tests for us.",
    "reflections": [
      "This name must be understood with An-Nāfi' (The Benefiter). He controls both to maintain balance and test humanity.",
      "Sometimes what seems harmful is a wake-up call or a means of purification."
    ],
    "related_names": ["An-Nāfi'", "Al-Qābiḍ", "Al-Bāsiṭ"],
    "dhikr_time": "During times of trial and tribulation.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 92,
    "name_ar": "ٱلنَّافِعُ",
    "transliteration": "An-Nāfi'",
    "translation_en": "The Benefiter",
    "translation_bn": "উপকারকারী",
    "description": "The one who creates all benefit and advantage. All good comes from Him.",
    "benefit": "Recitation during a journey or for a task brings success and benefit.",
    "dua": "Yā Nāfi', grant me benefit in my knowledge, my wealth, and my time, and make me beneficial to others.",
    "quran_reference": {
      "surah": "Al-Fath",
      "verse": "11",
      "text_ar": "قُلْ فَمَن يَمْلِكُ لَكُم مِّنَ ٱللَّهِ شَيْـًٔا إِنْ أَرَادَ بِكُمْ ضَرًّا أَوْ أَرَادَ بِكُمْ نَفْعًا",
      "text_en": "Say, 'Then who could prevent Allah at all if He intended for you harm or intended for you benefit?'"
    },
    "audio_url": "https://yourcdn.com/audio/an-nafi.mp3",
    "tags": ["Benefit", "Goodness", "Advantage"],
    "recitation_count": {
      "recommended": 201,
      "reward": "The reciter will be successful in all their good endeavors."
    },
    "daily_tip": "Do something beneficial for your community today, seeking the pleasure of An-Nāfi'.",
    "reflections": [
      "This name is the counterpart to Aḍ-Ḍārr. He is the ultimate source of all that is good for us.",
      "Trusting in An-Nāfi' frees me from relying on people for benefit."
    ],
    "related_names": ["Aḍ-Ḍārr", "Al-Barr", "Ar-Razzāq"],
    "dhikr_time": "When starting a new business or undertaking.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 93,
    "name_ar": "ٱلنُّورُ",
    "transliteration": "An-Nūr",
    "translation_en": "The Light",
    "translation_bn": "জ্যোতি",
    "description": "The one who is the light of the heavens and the earth. He guides with His light whom He wills.",
    "benefit": "Recitation fills the heart with inner light (Nur) and bestows spiritual insight.",
    "dua": "Yā Nūr, illuminate my heart, my grave, and my path with Your light.",
    "quran_reference": {
      "surah": "An-Nur",
      "verse": "35",
      "text_ar": "ٱللَّهُ نُورُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ",
      "text_en": "Allah is the Light of the heavens and the earth."
    },
    "audio_url": "https://yourcdn.com/audio/an-nur.mp3",
    "tags": ["Light", "Guidance", "Clarity"],
    "recitation_count": {
      "recommended": 256,
      "reward": "The reciter will receive inner light and their face will be radiant."
    },
    "daily_tip": "Seek light through the Quran today, which is a light from An-Nūr.",
    "reflections": [
      "Physical light is only a creation of His. He is the true, absolute Light.",
      "Without His light of guidance, we would all be lost in darkness."
    ],
    "related_names": ["Al-Hādī", "Aẓ-Ẓāhir", "Al-Badī'"],
    "dhikr_time": "After morning prayer or when feeling lost and confused.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 94,
    "name_ar": "ٱلْهَادِي",
    "transliteration": "Al-Hādī",
    "translation_en": "The Guide",
    "translation_bn": "পথপ্রদর্শক",
    "description": "The one who provides guidance and leads His servants to the path of righteousness.",
    "benefit": "Recitation grants spiritual knowledge and divine guidance.",
    "dua": "Yā Hādī, guide me to the straight path and make me a means of guidance for others.",
    "quran_reference": {
      "surah": "Al-Hajj",
      "verse": "54",
      "text_ar": "وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِينَ ءَامَنُوٓا۟ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
      "text_en": "And indeed, Allah is the Guide of those who have believed to a straight path."
    },
    "audio_url": "https://yourcdn.com/audio/al-hadi.mp3",
    "tags": ["Guidance", "Direction", "Path"],
    "recitation_count": {
      "recommended": 20,
      "reward": "The reciter will be blessed with spiritual guidance and knowledge."
    },
    "daily_tip": "When making a decision today, pray two rak'ah (Istikhara) and ask Al-Hādī for guidance.",
    "reflections": [
      "I can't find the right way by my own intellect alone; I am in constant need of Al-Hādī.",
      "He guides not only through scripture, but through signs, people, and events."
    ],
    "related_names": ["An-Nūr", "Ar-Rashīd", "Al-Fattāḥ"],
    "dhikr_time": "When seeking direction in life or making a choice.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 95,
    "name_ar": "ٱلْبَدِيعُ",
    "transliteration": "Al-Badī'",
    "translation_en": "The Incomparable Originator",
    "translation_bn": "অভিনব সৃষ্টিকারী",
    "description": "The one who originates all of creation in a unique and incomparable way, without any preceding example.",
    "benefit": "Recitation for a specific purpose or in times of distress can bring relief. It enhances creativity.",
    "dua": "Yā Badī', Originator of the heavens and the earth, relieve my grief and grant me success in my creative endeavors.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "117",
      "text_ar": "بَدِيعُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضِ",
      "text_en": "Originator of the heavens and the earth."
    },
    "audio_url": "https://yourcdn.com/audio/al-badi.mp3",
    "tags": ["Originator", "Creator", "Unique", "Incomparable"],
    "recitation_count": {
      "recommended": 70000,
      "reward": "Reciting 'Yā Badī' al-samāwāti wal-'arḍ' helps in accomplishing difficult tasks."
    },
    "daily_tip": "Appreciate the unique beauty of creation today, from a snowflake to a fingerprint, and remember the Originator.",
    "reflections": [
      "Every single thing in existence is a masterpiece of His unique creation.",
      "This name inspires me to think outside the box and pursue innovation in a good way."
    ],
    "related_names": ["Al-Khāliq", "Al-Bāri'", "Al-Muṣawwir"],
    "dhikr_time": "When in grief or when starting a creative project.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 96,
    "name_ar": "ٱلْبَاقِي",
    "transliteration": "Al-Bāqī",
    "translation_en": "The Everlasting One",
    "translation_bn": "চিরস্থায়ী",
    "description": "The one whose existence is eternal and will never end. He is everlasting.",
    "benefit": "Recitation ensures that one's good deeds are accepted and preserved, and provides protection.",
    "dua": "Yā Bāqī, make me firm upon deeds that are everlasting and grant me a place in the everlasting abode.",
    "quran_reference": {
      "surah": "Ar-Rahman",
      "verse": "27",
      "text_ar": "وَيَبْقَىٰ وَجْهُ رَبِّكَ ذُو ٱلْجَلَـٰلِ وَٱلْإِكْرَامِ",
      "text_en": "And there will remain the Face of your Lord, Owner of Majesty and Honor."
    },
    "audio_url": "https://yourcdn.com/audio/al-baqi.mp3",
    "tags": ["Everlasting", "Eternal", "Perpetual"],
    "recitation_count": {
      "recommended": 113,
      "reward": "The reciter will be saved from all dangers and their work will be preserved."
    },
    "daily_tip": "Focus on deeds that have an everlasting reward (Sadaqah Jariyah), as they will remain, unlike worldly things.",
    "reflections": [
      "Everything I love and own will perish, but Allah will remain. This puts life into perspective.",
      "Connecting with the Everlasting gives a sense of stability in a transient world."
    ],
    "related_names": ["Al-Ākhir", "Al-Wārith", "Aṣ-Ṣamad"],
    "dhikr_time": "Before sunrise, for protection and perseverance of deeds.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 97,
    "name_ar": "ٱلْوَارِثُ",
    "transliteration": "Al-Wārith",
    "translation_en": "The Inheritor of All",
    "translation_bn": "উত্তরাধিকারী",
    "description": "The one to whom all possessions return after their temporary owners are gone. He is the sole inheritor of the universe.",
    "benefit": "Recitation leads to long life and success in one's endeavors.",
    "dua": "Yā Wārith, make me among the righteous inheritors of Paradise.",
    "quran_reference": {
      "surah": "Al-Hijr",
      "verse": "23",
      "text_ar": "وَإِنَّا لَنَحْنُ نُحْىِۦ وَنُمِيتُ وَنَحْنُ ٱلْوَٰرِثُونَ",
      "text_en": "And indeed, it is We who give life and cause death, and We are the Inheritor."
    },
    "audio_url": "https://yourcdn.com/audio/al-warith.mp3",
    "tags": ["Inheritor", "Heir", "Successor"],
    "recitation_count": {
      "recommended": 707,
      "reward": "Helps in getting guidance on difficult problems and grants a pious child."
    },
    "daily_tip": "Use the resources Allah has given you wisely, as they will all return to Him, the True Inheritor.",
    "reflections": [
      "Nothing is truly mine; I am just a temporary trustee.",
      "This name frees me from the pain of loss, as everything belongs to Allah in the first place."
    ],
    "related_names": ["Al-Bāqī", "Mālik-ul-Mulk"],
    "dhikr_time": "Between Maghrib and Isha, for guidance and success.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 98,
    "name_ar": "ٱلرَّشِيدُ",
    "transliteration": "Ar-Rashīd",
    "translation_en": "The Guide to the Right Path",
    "translation_bn": "সঠিক পথ প্রদর্শক",
    "description": "The one who is the ultimate guide to righteousness and who directs all things to their correct course with perfect wisdom.",
    "benefit": "Recitation helps in planning and managing tasks successfully and provides protection from mishaps.",
    "dua": "Yā Rashīd, guide my plans and decisions, and keep me on the path of righteousness.",
    "quran_reference": {
      "surah": "Al-Jinn",
      "verse": "10",
      "text_ar": "وَأَنَّا لَا نَدْرِىٓ أَشَرٌّ أُرِيدَ بِمَن فِى ٱلْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا",
      "text_en": "And we do not know whether evil is intended for those on earth or whether their Lord intends for them a right course."
    },
    "audio_url": "https://yourcdn.com/audio/ar-rashid.mp3",
    "tags": ["Guidance", "Righteousness", "Wisdom"],
    "recitation_count": {
      "recommended": 514,
      "reward": "Helps in the execution of plans and protects from financial problems."
    },
    "daily_tip": "Before starting a project, seek guidance from Ar-Rashīd to ensure it follows a righteous and wise path.",
    "reflections": [
      "While Al-Hādī shows the path, Ar-Rashīd ensures the journey on the path is wise and rightly-guided.",
      "His guidance is not just about belief, but also about practical wisdom in worldly affairs."
    ],
    "related_names": ["Al-Hādī", "Al-Ḥakīm", "Al-'Alīm"],
    "dhikr_time": "Between Maghrib and Isha for help in decision making.",
    "is_favorite": false,
    "user_notes": []
  },
  {
    "id": 99,
    "name_ar": "ٱلصَّبُورُ",
    "transliteration": "Aṣ-Ṣabūr",
    "translation_en": "The Patient One",
    "translation_bn": "ধৈর্যশীল",
    "description": "The one who is most patient and forbearing. He does not hasten to punish the disobedient, giving them time to repent.",
    "benefit": "Recitation provides patience and perseverance in times of difficulty, anxiety, and grief.",
    "dua": "Yā Ṣabūr, grant me beautiful patience (ṣabran jamīlā) to endure my trials and remain steadfast.",
    "quran_reference": {
      "surah": "Al-Baqarah",
      "verse": "153",
      "text_ar": "إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ",
      "text_en": "Indeed, Allah is with the patient."
    },
    "audio_url": "https://yourcdn.com/audio/as-sabur.mp3",
    "tags": ["Patience", "Perseverance", "Forbearance"],
    "recitation_count": {
      "recommended": 100,
      "reward": "The reciter will be saved from difficulties and will be given patience."
    },
    "daily_tip": "When faced with a delay or frustration today, practice patience and remember the patience of Aṣ-Ṣabūr with His creation.",
    "reflections": [
      "If Allah can be so patient with all the disobedience He witnesses, surely I can be more patient with my small troubles.",
      "This name is a source of immense strength, reminding me that Allah is with those who are patient."
    ],
    "related_names": ["Al-Ḥalīm", "Al-Ghafūr"],
    "dhikr_time": "Before sunrise or anytime one is afflicted with calamity or sorrow.",
    "is_favorite": false,
    "user_notes": []
  }
]
